[
  {
    "name": "Triple-layered berry cheesecake",
    "description": "Make this showstopping cheesecake for summer entertaining. Top with strawberries or a mix of fresh berries, plus a drizzle of chocolate for extra indulgence",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/triple-layered-berry-cheesecake-878b1b4.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/triple-layered-berry-cheesecake",
    "keywords": "Anna Glover, Cheesecake, Dessert, Indulgent, Strawberries, Summer",
    "prepTime": "PT30M",
    "cookTime": "PT4M",
    "totalTime": "PT34M",
    "recipeYield": "Serves 10-12",
    "nutrition": {
      "calories": "400 calories",
      "fatContent": "32 grams fat",
      "saturatedFatContent": "19 grams saturated fat",
      "carbohydrateContent": "22 grams carbohydrates",
      "sugarContent": "14 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "4 grams protein",
      "sodiumContent": "0.6 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Dessert",
    "recipeIngredients": [
      "100g butter melted, plus extra for the tin",
      "200g digestive biscuits",
      "2 gelatine leaves",
      "50g raspberries",
      "50g caster sugar plus 2 tbsp",
      "350g strawberries",
      "500g full-fat soft cheese",
      "250ml double cream",
      "few drops red or pink food colouring",
      "1 tbsp vanilla bean paste",
      "50g white chocolate melted",
      "few drops lemon extract (optional)"
    ],
    "recipeInstructions": [
      {
        "text": "Butter and line the base and sides of a 20cm springform tin. Blitz the digestives in a food processor until you get fine crumbs, or bash in a sandwich bag with a rolling pin. Transfer to a bowl and stir in the melted butter until it looks like damp sand. Tip into the prepared tin, and smooth the mixture with the back of a spoon to make an even base, then chill."
      },
      {
        "text": "Soak the gelatine leaves in cold water. Put the raspberries in a food processor or in a jug using a stick blender, and blitz to a smooth purée. Sieve out the seeds. Warm the raspberry sauce in a small pan with 1 tbsp sugar until just starting to steam, then pour over 1 drained gelatine leaf in a bowl and stir to dissolve."
      },
      {
        "text": "Blitz 3 (about 65g) of the strawberries in a food processor, and warm through with 1 tbsp sugar in the same way. Tip into a bowl and stir in the other drained gelatine leaf."
      },
      {
        "text": "Whisk the soft cheese, cream and caster sugar until it just starts to thicken. Divide between three bowls (about 260g per bowl). Fold the strawberry purée into one with a few drops of food colouring to make it light pink, the raspberry mix with the gelatine into another with more food colouring so it’s dark pink, and the vanilla bean paste into the third."
      },
      {
        "text": "Spoon the raspberry filling over the biscuit base, smoothing the surface so it’s flat. Next, add the strawberry filling, gently smoothing over without disturbing the bottom layer, then repeat with the vanilla mixture, using a clean spoon to level the top. A spatula or knife might help with this to keep from dragging the below layers. Chill for 4 hrs or overnight."
      },
      {
        "text": "Run a knife around the sides of the cake tin between the cheesecake and the parchment, and loosen the base. Transfer to a cake stand, and smooth the sides, using a palette knife, to neaten the layers. Mix the chocolate with a few drops of lemon extract, if using. Pile the remaining strawberries, some sliced, some whole, on top, and drizzle over the chocolate to finish."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/raspberry-cheesecake-tacos"
  },
  {
    "name": "Raspberry brûlée",
    "description": "Celebrate raspberry season with this take on crème brûlée. The sharp tang of this red fruit cuts through a rich custard base for the perfect summer dessert",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/raspberry-brulee-4c54f2c.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/raspberry-brulee",
    "keywords": "Berries, crème brûlée, Eggs, Gluten free, Raspberries, Rosie Birkett, Summer, Summer dessert",
    "prepTime": "PT15M",
    "cookTime": "PT30M",
    "totalTime": "PT45M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "523 calories",
      "fatContent": "46 grams fat",
      "saturatedFatContent": "27 grams saturated fat",
      "carbohydrateContent": "22 grams carbohydrates",
      "sugarContent": "22 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "5 grams protein",
      "sodiumContent": "0.1 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Dessert",
    "recipeIngredients": [
      "1 vanilla pod",
      "½ lemon pared zest only",
      "300ml double cream",
      "100g raspberries",
      "4 egg yolks",
      "2 tbsp golden caster sugar",
      "2 tbsp demerara sugar"
    ],
    "recipeInstructions": [
      {
        "text": "Split the vanilla pod and scrape the seeds into a pan with the lemon zest and cream. Toss the pod in too. Heat until just before the cream boils – tiny bubbles will be forming at the edges. Turn off the heat and infuse for 15 mins."
      },
      {
        "text": "Heat oven to 160C/140C fan/gas 3. Put four ramekins into a roasting tin and fill the tin with boiling water so that about 2cm of the ramekins is uncovered."
      },
      {
        "text": "Divide the raspberries between the ramekins, reserving a few. Whisk the egg yolks and caster sugar, using an electric whisk, until very pale and fluffy, about 3 mins. Remove the zest and vanilla pod from the cooled cream, then slowly stir it into the egg mixture. Transfer to a jug and pour through a sieve into the ramekins, then top with the reserved raspberries. Bake in the oven for 20-25 mins until the custard forms a skin and holds a slight wobble when you nudge the tray. Allow to cool, then chill in the fridge for at least 4 hrs."
      },
      {
        "text": "If you don’t have a blowtorch, heat the grill to high. Sprinkle demerara sugar over each ramekin and either use a blowtorch to caramelise the top or place them under the grill until the sugar has melted and crisped. Allow to settle for 5 mins before serving."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/caramelised-strawberry-custard-pots"
  }
]