[
  {
    "name": "Vegan chocolate yule log",
    "description": "Make this vegan chocolate yule log ahead of time to avoid any stress on the day of your festivities. It's a little more effort but worth every second",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/Vegan-chocolate-yule-log-13d6b83.jpg?resize=768,845",
        "width": 768,
        "height": 845
      },
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/Vegan-chocolate-yule-log-13d6b83.jpg?resize=1366,1502",
        "width": 1366,
        "height": 1502
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/vegan-chocolate-yule-log",
    "keywords": "Baking, Chocolate, Christmas, Dessert, Ganache, Vegan, Yule log",
    "prepTime": "PT50M",
    "cookTime": "PT25M",
    "totalTime": "PT1H15M",
    "recipeYield": 8,
    "nutrition": {
      "calories": "409 calories",
      "fatContent": "23 grams fat",
      "saturatedFatContent": "10 grams saturated fat",
      "carbohydrateContent": "42 grams carbohydrates",
      "sugarContent": "27 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "6 grams protein",
      "sodiumContent": "0.8 milligram of sodium"
    },
    "recipeIngredients": [
      "120g self-raising flour",
      "25g cocoa powder",
      "100g caster sugar",
      "1 tsp baking powder",
      "10g cornflour",
      "½ tsp bicarbonate of soda",
      "75ml whole oat milk",
      "110ml aquafaba",
      "50ml vegetable oil",
      "1 tsp vanilla extract",
      "2 tbsp icing sugar plus extra for dusting",
      "200ml plant-based double cream plus extra to serve (optional)",
      "1 tsp vanilla extract",
      "250g silken tofu",
      "150g dark chocolate broken into pieces",
      "2 tbsp maple syrup"
    ],
    "recipeInstructions": [
      {
        "text": "Heat the oven to 180C/160C fan/gas 4 and line a swiss roll tin (approx. 32cm x 22cm) with baking parchment."
      },
      {
        "text": "First, make the ganache by combining the silken tofu and dark chocolate in a medium saucepan over a low heat, stirring until the chocolate has melted – it will look lumpy at this stage but don’t worry. Add the maple syrup, vanilla extract and a pinch of salt, stir to combine and take off the heat. Use an electric whisk to transform the mixture into a silky smooth ganache, about 2-3 mins. Transfer to a piping bag and put in the fridge to cool."
      },
      {
        "text": "To make the sponge, sift all the dry ingredients (flour, cocoa powder, caster sugar, baking powder, cornflour, bicarbonate of soda and ½ tsp salt) together in a mixing bowl. In a small jug, combine the oat milk and vinegar to create a vegan buttermilk. Set aside."
      },
      {
        "text": "In a separate mixing bowl, whisk the aquafaba until the liquid has transformed to soft peaks – be patient as this can take up to 5 mins. It’s best to use an electric handheld whisk or freestanding mixer."
      },
      {
        "text": "Add the vegetable oil and vanilla extract to the jug of oat milk and vinegar. Pour the wet ingredients into the bowl of dry ingredients and use large metal spoon to combine until you have a thick batter. Stir a third of the whipped aquafaba into the batter. Once the batter has loosened slightly, tip the chocolate batter into the bowl with the remaining aquafaba and fold through until combined, being careful not to knock too much air from the mixture. Pour this into the prepared baking tin, level out with a spatula, and bake for 20-22 mins."
      },
      {
        "text": "Leave the sponge in the tin to cool for 5 mins before turning it out onto a large piece of parchment dusted with 1 tbsp icing sugar. Peel off the top parchment used to line the tin and leave for a further 2-3 mins to cool slightly. While still slightly warm, use the baking parchment to roll the sponge from the short end, creating a log. Carefully unroll and allow to cool completely – rolling the sponge while slightly warm helps prevent large cracks. But don’t worry if there are small cracks as they’ll be hidden by the ganache."
      },
      {
        "text": "For the filling, whisk the icing sugar, vanilla extract and plant-based double cream in a bowl until soft peaks have formed. The sponge should now be cool. Spread an even layer of the cream over the flat sponge. Then, as before, roll the filled sponge into a log and use the baking parchment to hold in a log shape. Transfer to a plate or board and into the fridge for 30 mins-1 hr."
      },
      {
        "text": "When you are ready to decorate, carefully unwrap the yule log from the parchment. Snip the end of the piping bag and pipe thick horizontal lines to cover the sponge with chocolate ganache. Use a spoon to create a soft pillowy finish to the ganache, or a fork to create a bark-like effect. Finish with any accompanying decorations – berries, edible holly décor or a spritz of gold spray. Transfer to the fridge for at least 1 hr or until you’re ready to serve."
      },
      {
        "text": "Serve with more pouring cream and berries, if you like."
      }
    ],
    "skillLevel": "More effort",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/vegan-yule-log"
  },
  {
    "name": "Miso ramen",
    "description": "Not sure about the taste of tofu? In this miso ramen, it's fried in a delicious sweet and sticky glaze and is accompanied by amazing Japanese flavours – delicious",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/miso-ramen-514e2ca.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/miso-ramen",
    "keywords": "Japanese, Miso, Ramen, Tofu, Tom Kerridge, Vegan, Vegetarian",
    "prepTime": "PT10M",
    "cookTime": "PT15M",
    "totalTime": "PT25M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "383 calories",
      "fatContent": "7 grams fat",
      "saturatedFatContent": "1 grams saturated fat",
      "carbohydrateContent": "57 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "4 grams fiber",
      "proteinContent": "20 grams protein",
      "sodiumContent": "5.2 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "5 tbsp miso paste",
      "2 tbsp soy sauce",
      "2.5cm piece ginger grated",
      "12 shiitake mushrooms",
      "225g smoked tofu cut into 4 slices",
      "2 tbsp liquid aminos or tamari",
      "250g soba noodles",
      "16 ears baby corn",
      "1 tbsp vegetable oil",
      "8 baby pak choi",
      "200g ready-to-eat beansprouts (if they’re not labelled ready-to-eat, cook thoroughly until steaming hot throughout)",
      "2 red chillies finely sliced on an angle",
      "2 spring onions finely sliced on an angle",
      "4 tbsp crispy seaweed",
      "2 tbsp black sesame seeds",
      "1 tbsp sesame oil to finish"
    ],
    "recipeInstructions": [
      {
        "text": "Put the miso, 1.5 litres water, soy sauce, ginger and shiitake in a large saucepan. Stir to mix in the miso, then bring to a very gentle simmer. Keep simmering for 5 mins."
      },
      {
        "text": "Meanwhile, place the smoked tofu in a shallow bowl and pour over the liquid aminos. Turn the tofu slices over to make sure they are soaked well on both sides."
      },
      {
        "text": "Bring a pan of salted water to the boil. Add the soba noodles, bring back to the boil and cook until just tender, about 5 mins."
      },
      {
        "text": "Add the baby corn to the miso broth and cook for a further 4 mins."
      },
      {
        "text": "Meanwhile, heat the oil in a non-stick frying pan over a high heat. Lift the tofu from its bowl, shaking off the excess liquid aminos and saving it. Gently place the tofu in the frying pan and cook for 2-3 mins on each side until browned. Add the reserved liquid aminos to the pan (it will bubble up) and reduce to a glaze. Remove from the heat."
      },
      {
        "text": "As soon as the noodles are cooked, drain them in a colander and rinse under cold water, then divide between four serving bowls. Add the pak choi to the miso broth and remove from the heat."
      },
      {
        "text": "Divide the pak choi, baby corn and beansprouts between the bowls. Ladleover the miso broth and add the tofu. Garnish with the chillies, spring onions and crispy seaweed. Sprinkle with sesame seeds, drizzle over the sesame oil and serve straightaway."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/quick-easy-soba-ramen"
  }
]