[
  {
    "name": "Grazing platter",
    "description": "Gather together all your favourite nibbles and combine the best of a cheeseboard and charcuterie platter for this indulgent selection of party food",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/11/Grazing-platter-8cd15be.jpg?resize=768,713",
        "width": 768,
        "height": 713
      },
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/11/Grazing-platter-8cd15be.jpg?resize=900,836",
        "width": 900,
        "height": 836
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/grazing-platter",
    "keywords": "charcuterie, Cheeseboard, Christmas food, grazing platter, Party food, Sharing food",
    "recipeIngredients": [
      "baked cheese such as brie or camembert, topped with herbs and olive oil",
      "figs grapes, prepared pomegranates or dried fruits",
      "thinly sliced cured meats such as sausage or chorizo",
      "savoury crackers crusty bread or breadsticks",
      "nuts and olives",
      "dips such as hummus, chutney or taramasalata",
      "honey or olive oil, for drizzling",
      "a variety of cheeses such as soft-rind goat’s cheese, a hard cheese (like cheddar, gruyère or manchego) and stilton"
    ],
    "recipeInstructions": [
      {
        "text": "A grazing board combines the best of a cheeseboard and charcuterie platter into one indulgent selection of food. There’s no strict recipe for a grazing board – simply gather together all your favourite nibbles, and arrange on a large platter or plate to share. You could do a mixture of meats and cheese, or go entirely vegetarian or vegan. The key things to remember when creating your platter, to make it look (and taste) as impressive as possible, are: ● Make sure you assemble the board just before serving so everything is fresh ● Always include crackers, breadsticks or bread to use as a vessel for cheeses or dips ● Use small bowls or ramekins to hold small items and dips, like olives, nuts and chutneys ● Use a good variety of ingredients. For example, aim for one hard and one soft cheese, two or three different cured meats, and a few varieties of fruits and nuts ● If you use larger fruits, like figs or clementines, chop and tear them into different shapes, so that the fruit is easier to pick up and looks more appealing on the platter ● Swirl any dips into ramekins, and top with olive oil, seeds or chopped herbs ● Fill in any gaps on your platter with bay leaves or rosemary sprigs to decorate ● Bundle any cured meats into nests, or roll or fold to create a variety of textures"
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/grazing-platter"
  },
  {
    "name": "Clementine-printed gift tags",
    "description": "Got leftover clementines or oranges? Use them to create bespoke Christmas name tags – they’re a beautiful and thoughtful addition to a festive gift",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Clementine-Name-Tags-3064eac.jpg?resize=768,713",
        "width": 768,
        "height": 713
      },
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Clementine-Name-Tags-3064eac.jpg?resize=900,836",
        "width": 900,
        "height": 836
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/clementine-printed-gift-tags",
    "keywords": "Christmas crafts, Clementine, homemade gift tag",
    "recipeIngredients": [
      "1 clementine orange or other citrus fruit",
      "paint brush",
      "acrylic paint",
      "card",
      "hole punch",
      "string or ribbon",
      "felt tip or permanent marker",
      "stencil (optional)"
    ],
    "recipeInstructions": [
      {
        "text": "Cut the clementine in half and leave it to dry out overnight."
      },
      {
        "text": "Paint a thin layer of acrylic paint over the top of the cut-side of the fruit. Press the painted side onto the card, repeating until the sheet of card is filled with prints – you may have to reapply the paint. Leave to dry completely."
      },
      {
        "text": "Cut the card into rectangles around the clementine prints. Hole-punch the top of each rectangle and tie a 15cm piece of ribbon or string through each hole."
      },
      {
        "text": "Write the recipient’s name across the print using a felt tip pen or marker, and stencil, if you like."
      }
    ],
    "skillLevel": null,
    "forcedURL": "https://www.bbcgoodfood.com/recipes/clementine-printed-gift-tags"
  },
  {
    "name": "Fairy case ornaments",
    "description": "Enjoy making these adorable Christmas tree decorations with children. They are a perfect festive activity, and handy for using up leftover fairy cake cases",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Fairy-Case-Ornaments-022cc79.jpg?resize=768,713",
        "width": 768,
        "height": 713
      },
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Fairy-Case-Ornaments-022cc79.jpg?resize=900,836",
        "width": 900,
        "height": 836
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/fairy-case-ornaments",
    "keywords": "Christmas crafts, Christmas decorations, Fairy cake cases",
    "recipeIngredients": [
      "selection of patterned paper fairy cake or cupcake cases",
      "glue stick",
      "golden string or ribbon",
      "hole punch"
    ],
    "recipeInstructions": [
      {
        "text": "Flatten each fairy cake case and cut into quarters. Decide which mix of patterns you’d like for each tree ornament – you’ll need four quarters per decoration."
      },
      {
        "text": "Put some glue on the pointed top of a quarter (this one will be at the bottom of the ornament), with the curved edge facing towards you. Put another quarter on top, facing the same way and making sure a little of the first case is still on show before pressing down into the glue. Repeat twice more. There should be four quarters glued on top of one another to make a tree shape."
      },
      {
        "text": "Cut a 15cm strand of string or ribbon. Punch a hole in the top of the ornament, then thread the string through and tie the ends together. Repeat the process with the remaining fairy cake cases."
      }
    ],
    "skillLevel": null,
    "forcedURL": "https://www.bbcgoodfood.com/recipes/fairy-case-ornaments"
  },
  {
    "name": "Wreath place settings",
    "description": "Make your own Christmas place settings - they're a wonderful way to decorate the table and guests can take theirs home to use as a decoration",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Wreath-Place-Setting-af2e9d6.jpg?resize=768,713",
        "width": 768,
        "height": 713
      },
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Wreath-Place-Setting-af2e9d6.jpg?resize=900,836",
        "width": 900,
        "height": 836
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/wreath-place-settings",
    "keywords": "Christmas crafts, Christmas wreath, place settings",
    "recipeIngredients": [
      "2 shades of green card",
      "hole punch (optional)",
      "red card",
      "glue stick",
      "ribbon or string (optional)",
      "brown card",
      "felt tip pen",
      "stencil (optional)",
      "glittery letter stickers (optional)"
    ],
    "recipeInstructions": [
      {
        "text": "Cut a circle out of a piece of green card, 20cm in diameter, then fold in half to cut a 10cm circle out of the middle. This forms the base of the wreath. Cut 8cm-long holly shapes out of the different shades of green card – you will need 20-30 per wreath. Use a hole punch to cut out small circles of red card to make the berries."
      },
      {
        "text": "Glue the holly leaves around the circle of green card, filling the gaps with overlapping pieces. Glue the berries in clusters at the bottom points of some of the holly leaves."
      },
      {
        "text": "If you would like to hang the wreaths, hole-punch one of the leaves at the top of the wreath and tie the ribbon or string through it."
      },
      {
        "text": "To make a name tag, cut a small rectangle out of brown card and write on it using a felt tip pen and stencil, if you like. Alternatively, use glittery letter stickers. Glue the name tag to the bottom of the wreath. Repeat the process for the remaining place settings."
      }
    ],
    "skillLevel": null,
    "forcedURL": "https://www.bbcgoodfood.com/recipes/wreath-place-settings"
  }
]