[
  {
    "name": "Beets & carrots with cumin & haydari",
    "description": "Haydari is a Turkish meze of strained yogurt, herbs and garlic and it pairs well with crunchy carrots and beetroot in this simple veggie starter",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/beets-and-carrots-e9c3f33.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/beets-carrots-cumin-haydari",
    "keywords": "2 of 5-a-day, Beetroot, Diana Henry, Fibre, Folate, Gluten free, haydari, Meze, Sharing, Vegetarian",
    "prepTime": "PT45M",
    "cookTime": "PT10M",
    "totalTime": "PT55M",
    "recipeYield": "6 as a starter or as part of a meze spread",
    "nutrition": {
      "calories": "288 calories",
      "fatContent": "19 grams fat",
      "saturatedFatContent": "6 grams saturated fat",
      "carbohydrateContent": "18 grams carbohydrates",
      "sugarContent": "16 grams sugar",
      "fiberContent": "6 grams fiber",
      "proteinContent": "8 grams protein",
      "sodiumContent": "0.4 milligram of sodium"
    },
    "recipeCategory": "Snack, Starter",
    "recipeIngredients": [
      "400g Greek yogurt",
      "1 red and 1 green chilli halved, deseeded and very finely chopped",
      "small pack dill leaves only, roughly chopped",
      "2 garlic cloves crushed",
      "5 tbsp extra virgin olive oil",
      "600g cooked beetroot (not pickled)",
      "400g carrots",
      "2 tsp toasted cumin seeds",
      "½ tsp white balsamic vinegar",
      "½ lemon",
      "25g walnut pieces lightly toasted"
    ],
    "recipeInstructions": [
      {
        "text": "Make the haydari 2 hrs ahead of when you want to serve. Line a sieve with a piece of muslin or a brand- new J-cloth. Tip in the yogurt and leave for 2 hrs to thicken."
      },
      {
        "text": "Put the drained yogurt in a bowl and combine with 2 tbsp of the olive oil, the dill (keeping some back for serving), garlic and chilli – don’t overmix, you should still be able to see bits of chilli."
      },
      {
        "text": "Peel and cut the carrots into matchsticks, and the beetroots into wedges. Heat 2 tbsp of the oil in a large frying pan over a medium heat. Add half the cumin seeds, cook for 30 secs, then add the carrots. Stir-fry for 1 min, then add the vinegar, a good squeeze of lemon and some seasoning and quickly remove from the pan. Add 1/2 tbsp of oil to the pan with the rest of the cumin seeds. Cook for 30 secs, then add the beetroot. Squeeze on some more lemon juice and season."
      },
      {
        "text": "Put some of the haydari on each of six plates, flattening it and swirling it a little with the back of a spoon. Spoon some beetroot on top, then some carrots, sprinkle with dill and walnuts, drizzle with a little more of the olive oil and serve."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/beets-carrots-cumin-haydari"
  },
  {
    "name": "Sourdough starter kit",
    "description": "For the keen baker, why not give the gift of a sourdough recipe kit? Fill a jar with everything they need and add the final flourishes to make it Christmas ready",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/sourdough-starter-kit-9c602ce.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/sourdough-starter-kit",
    "keywords": "Bread, Christmas, Gift, Homemade, kit, Sophie Godwin, Sourdough, Winter",
    "recipeIngredients": [
      "500g bag organic rye flour",
      "1-litre glass Kilner jar",
      "muslin",
      "wooden spoon"
    ],
    "recipeInstructions": [
      {
        "text": "To use the kit: Write the following instructions on a gift tag: Put 200g flour in the Kilner jar with 200ml cool water. Mix well, then cover with the muslin, leaving the lid off. Leave the mixture somewhere warm but away from direct sunlight for 2-3 days until it has swelled and is frothing with bubbles."
      },
      {
        "text": "To ‘feed’ the starter, throw half of it away, then top up with 100g flour and 100ml cool water. Mix well and leave for two to three days more. Once the starter is puffy and foamy again, it is ready to use."
      },
      {
        "text": "When making sourdough bread, use as much of the starter as your recipe calls for, then keep it in the fridge, ‘feeding’ it 100g flour and 100ml cool water every week. Your starter will potentially last for years – it’s the gift that keeps on giving!"
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/sourdough-starter-kit"
  },
  {
    "name": "Whisky & pink peppercorn marmalade kit",
    "description": "This slightly spiced, fruity marmalade kit is the perfect gift for a keen baker and you can make it at home with a handful of hamper essentials",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/whisky-pink-peppercorn-marmalade-kit-215b1df.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/whisky-pink-peppercorn-marmalade-kit",
    "keywords": "Christmas, Gift, Homemade, kit, Marmalade, Miriam Nice, Present, Winter",
    "recipeIngredients": [
      "500g mix of oranges clementines and lemons",
      "1kg demerara sugar",
      "small pot of pink peppercorns",
      "small bottle of whisky",
      "jam pan",
      "muslin",
      "large wooden spoon",
      "small jars and labels (makes about 1kg jam)",
      "see tip"
    ],
    "recipeInstructions": [
      {
        "text": "To use the kit: Write the following instructions on the gift tag: Halve the fruits and squeeze the juices into a large saucepan. Remove all the peel and set aside. Put the flesh in the pan with 1 litre water and boil for 15 mins. Push through a sieve lined with muslin and return the liquid to the pan."
      },
      {
        "text": "Shred the peel and tip into a heatproof bowl. Add enough water to just cover and microwave for 3-4 mins until soft. Add the peel to the pan, then add the sugar. Boil for 35-45 mins until the marmalade has reached setting point (keep an eye on it so it doesn’t bubble over)."
      },
      {
        "text": "Remove from the heat and add 1 tsp pink peppercorns. Allow the mixture to cool a little, then stir in 50ml whisky. Ladle into sterilised jars and seal. Will keep for up to one year."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/whisky-pink-peppercorn-marmalade-kit"
  },
  {
    "name": "Gravadlax kit",
    "description": "With everything they’ll need to cure their own salmon Scandi-style, this homemade Christmas kit will make an inspired gift for any keen cook",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/gravadlax-kit-a27d90d.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/gravadlax-kit",
    "keywords": "Christmas, Gift, Gravadlax, Homemade, Present, Salmon, Sophie Godwin, Winter",
    "recipeIngredients": [
      "1 orange",
      "1 dill plant",
      "small pot of black peppercorns",
      "125g box of sea salt",
      "500g bag of demerara sugar",
      "small pot of coriander seeds",
      "small pot of caraway seeds",
      "a fishmonger gift voucher (to buy a 500g boneless piece of salmon)",
      "pestle and mortar (optional)"
    ],
    "recipeInstructions": [
      {
        "text": "To use the kit: Write the following instructions on the gift tag: To make the cure for your gravadlax, zest the orange and roughly chop a large bunch of dill. Using a pestle and mortar, grind 1 /2 tbsp peppercorns, then stir in 50g sea salt, 75g sugar, 1 tsp each coriander seeds and caraway seeds, and the zest."
      },
      {
        "text": "Put half the dill on a large piece of cling film and place your salmon on top. Cover with all the cure and the remaining dill, then wrap tightly. Place in a dish with something heavy on top to weigh it down."
      },
      {
        "text": "Leave to cure for 24-48 hrs, turning the salmon once, then rinse well and pat dry before serving. Will keep in the fridge for up to three days."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/gravadlax-kit"
  },
  {
    "name": "Bespoke martini kit",
    "description": "Put together a mixology kit as a Christmas gift with everything needed to make the perfect martini, including juniper berries, spices and olives to garnish",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/bespoke-martini-kit-535328f.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/bespoke-martini-kit",
    "keywords": "Christmas, Drinks, Gift, kit, Martini, Miriam Nice, Present, Winter",
    "recipeIngredients": [
      "700ml bottle rye vodka",
      "small pot of juniper berries",
      "small pod of green cardamom pods",
      "small pot of dried rose petals",
      "small pot of coriander seeds",
      "1 lemon",
      "1 coffee filter paper",
      "bottle of vermouth",
      "small jar of green olives",
      "2 martini glasses",
      "shot measure",
      "tall glass",
      "cocktail stirrer",
      "cocktail strainer"
    ],
    "recipeInstructions": [
      {
        "text": "To use the kit: Write the following instructions on the gift tag: Open the bottle of vodka and add 2 tbsp juniper berries, 6 cardamom pods, a pinch of dried rose petals, 1 tsp coriander seeds and a strip of lemon peel. Put the lid back on and leave in a cool dark place for 24 hrs."
      },
      {
        "text": "Strain the infused mixture through the coffee filter paper into a jug, then pour back into the bottle to store."
      },
      {
        "text": "To make a martini, chill 2 martini glasses in the fridge for 30 mins. Put 50ml vermouth in a tall glass, add 150ml infused vodka and a large handful of ice. Stir well until the outside of the glass feels cold, then strain into the chilled glasses. Garnish with an olive."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/bespoke-martini-kit"
  }
]