[
  {
    "name": "Chillied cheese on toast",
    "description": "A hearty slice of cheese on toast ticks all the boxes when time is short – satisfying, quick to make and popular with everyone",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10047_11-4242eda.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/chillied-cheese-toast",
    "keywords": "Beginners, Breakfast, Brunch, Cheese, Cheese on toast, Cherry tomato, Cherry tomatoes, Chilli flakes, Ciabatta, Gruyère, Jane Hornby, Snack, Toastie, Worcestershire sauce",
    "cookTime": "PT5M",
    "totalTime": "PT10M",
    "nutrition": {
      "calories": "250 calories",
      "fatContent": "11 grams fat",
      "saturatedFatContent": "6 grams saturated fat",
      "carbohydrateContent": "29 grams carbohydrates",
      "sugarContent": "3 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "13 grams protein",
      "sodiumContent": "1.16 milligram of sodium"
    },
    "recipeCategory": "Brunch, Dinner, Lunch, Main course, Supper",
    "recipeIngredients": [
      "4 slices ciabatta loaf, (cut on an angle to make the pieces larger)",
      "bunch spring onions finely sliced",
      "100g cherry tomato quartered",
      "100g gruyère grated",
      "1 tbsp dried chilli flakes",
      "splash Worcestershire sauce",
      "green salad to serve"
    ],
    "recipeInstructions": [
      {
        "text": "Heat grill to high, put the bread onto a baking sheet, then grill until just golden on both sides. Mix the onions, tomatoes, cheese and chilli flakes in a bowl, then scoop onto the toast. Shake over a little Worcestershire sauce and grill again until golden and melted. Serve with green salad."
      }
    ]
  },
  {
    "name": "Smoky maple duck salad",
    "description": "The chilli paste in this recipe can easily be swapped for harissa if easier. Either way it's a winner",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10051_10-80e4438.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/smoky-maple-duck-salad",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 30-60 minutes, 600 kcal or less, Chilli paste, Duck, Good Food, Mains, Maple, Maple syrup, Quick, Salad, Sherry vinegar",
    "cookTime": "PT20M",
    "totalTime": "PT30M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "527 calories",
      "fatContent": "36 grams fat",
      "saturatedFatContent": "10 grams saturated fat",
      "carbohydrateContent": "20 grams carbohydrates",
      "sugarContent": "18 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "32 grams protein",
      "sodiumContent": "0.54 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course",
    "recipeIngredients": [
      "2 duck breasts skin on and slashed",
      "3 tbsp maple syrup",
      "1 garlic clove crushed",
      "1 tbsp chipotle chilli paste (we like Discovery. Adjust to taste if you're using a different brand)",
      "160g bag bistro salad",
      "bunch radish about 200g/8oz, thinly sliced or grated",
      "1 tbsp sherry vinegar"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 220C/fan 200C/gas 7. Put a small roasting tin in the oven and let it heat up for a few mins. Season the duck skin and flesh well, then put into the tin, skin-side down, and roast for 10 mins until the skin is golden and crisp and the fat has run out. Leave for 15 mins if you like your duck well cooked through."
      },
      {
        "text": "Meanwhile, mix 2 tbsp maple syrup with the garlic and chilli paste. Tip the fat out from the pan, turn the duck skin-side up, then roast for another 5 mins, basting with the maple mix once or twice until sticky and glazed and the duck is pink in the middle. Remove and let the duck rest for 5 mins."
      },
      {
        "text": "Pile the salad and the radishes onto two serving plates. Slice the duck at an angle and nestle into the salad. Stir the rest of the maple syrup and the sherry vinegar into the pan juices, then drizzle over the salad, season and serve straight away."
      }
    ]
  },
  {
    "name": "Sausage & spring mash pie",
    "description": "Comfort food doesn't get much better than this",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9517_11-e4421ab.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/sausage-spring-mash-pie",
    "keywords": " Josh Eagleton, 30-60 minutes, 600 kcal or less, Alocohol, Beef stock, Booze, Caramelised red onion, Carrot, Carrots, Dijon mustard, Jane Hornby, Mains, Make ahead, Mash, Mashed potato, Mushroom, Mushrooms, Over an hour, Pie, Potato, Potatoes, Red onion, Red wine, Sauages, Sausage and mash, Savoy cabbage, Savoy cabbages, Shallot, Shallots",
    "cookTime": "PT45M",
    "totalTime": "PT1H",
    "recipeYield": 8,
    "nutrition": {
      "calories": "539 calories",
      "fatContent": "29 grams fat",
      "saturatedFatContent": "10 grams saturated fat",
      "carbohydrateContent": "47 grams carbohydrates",
      "sugarContent": "12 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "22 grams protein",
      "sodiumContent": "1.84 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "1.5kg potato cut into large chunks",
      "¼-½  Savoy cabbage shredded",
      "100ml milk",
      "50g butter",
      "1 tbsp Dijon mustard or wholegrain mustard (optional)",
      "2 tsp vegetable oil",
      "16 good-quality pork sausages",
      "10 shallots peeled and halved if large",
      "4 carrots thickly sliced",
      "2-3 thyme sprigs, plus extra to serve",
      "2 x 250g packs mushroom halved or quartered",
      "400ml full-bodied red wine",
      "300ml beef stock",
      "2 tbsp caramelised red onion (we like English Provender Company Lazy red onions)"
    ],
    "recipeInstructions": [
      {
        "text": "Boil the potatoes in salted water for 15 mins, adding the cabbage for the final few mins of cooking. Drain, then allow to steam- dry for a few mins. Add the milk and butter to the pan, warm through, then mash into the potatoes and cabbage with plenty of seasoning. Stir in the mustard, if using."
      },
      {
        "text": "While the potatoes are cooking, heat a large, shallow flameproof dish or a large non-stick frying pan. Brown the sausages, shallots and carrots for about 5 mins until nicely golden and the shallots are starting to soften. The sausages should be almost cooked through; lift them out, then set aside. Tip off any excess fat released by the sausages."
      },
      {
        "text": "Heat oven to 200C/fan 180C/gas 6. Turn up the heat under the pan, tip in the thyme and mushrooms, then fry until golden, about 3 mins. Splash in the wine, then let it bubble and reduce by half. Add the stock and caramelised onions, then simmer until it has reduced a little to make a shiny gravy, and the carrots are cooked through. Season, then add the sausages to the gravy."
      },
      {
        "text": "Spoon the mixture into a baking dish or keep in the pan if it’s ovenproof. Top with the mashed potato, spooning it over in even dollops to prevent the gravy oozing up the sides. Can be made up to 1 day ahead and chilled. Bake, covered with foil, for 30 mins (or 45 mins from chilled), removing the foil for the final 10 mins to brown the mash. Sprinkle with a little thyme to serve."
      }
    ]
  },
  {
    "name": "Gnocchi bolognese with spinach",
    "description": "A filling, cheesy bake that is great for lunch the nex day – if there's any left!",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9448_10-b7aceda.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/gnocchi-bolognese-spinach",
    "keywords": "Beef, Bolognaise, Bolognese, Chopped tomato, Chopped tomatoes, Gnocchi, Good Food, Make it tonight, Mince, Minced beef, Mozzarella, Pasta bake, Spinach",
    "cookTime": "PT30M",
    "totalTime": "PT35M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "518 calories",
      "fatContent": "18 grams fat",
      "saturatedFatContent": "8 grams saturated fat",
      "carbohydrateContent": "50 grams carbohydrates",
      "sugarContent": "9 grams sugar",
      "fiberContent": "6 grams fiber",
      "proteinContent": "44 grams protein",
      "sodiumContent": "2.4 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "500g lean minced beef",
      "1 tsp olive oil",
      "2 x 400g cans chopped tomato",
      "1 tbsp Italian herbs",
      "400g gnocchi",
      "125g reduced-fat mozzarella",
      "400g spinach washed"
    ],
    "recipeInstructions": [
      {
        "text": "Fry the mince in the oil for a few mins. Tip in the tomatoes and herbs. Fill one of the empty cans with water, add this to the beef, then bring to the boil. Simmer for 20 mins."
      },
      {
        "text": "Tip half the spinach into a colander and pour over boiling water to wilt, then repeat with the second half. Squeeze out as much moisture from the spinach as you can, then leave to drain in the colander. When the beef is almost ready, cook the gnocchi, then drain. Heat the grill to high."
      },
      {
        "text": "Stir the gnocchi and spinach into the beef, season, then tip into a large ovenproof dish. Tear the mozzarella into chunks, scatter over, then grill until golden and bubbling."
      }
    ]
  },
  {
    "name": "Greek pasta salad",
    "description": "For a fresh idea with pasta, try Greek salad",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-2681_11-461b11d.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/greek-pasta-salad",
    "keywords": " Josh Eagleton, 30-60 minutes, 4 servings, 600 kcal or less, BBC Good Food, Black olive, Black olives, Feta cheese, Fusilli, Good Food, Greek food, Mains, Olive oil, Salad, Spinach, Tomato, Tomatoes, Vegetables",
    "cookTime": "PT35M",
    "totalTime": "PT35M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "418 calories",
      "fatContent": "23 grams fat",
      "saturatedFatContent": "8 grams saturated fat",
      "carbohydrateContent": "37 grams carbohydrates",
      "fiberContent": "5 grams fiber",
      "proteinContent": "18 grams protein",
      "sodiumContent": "3.48 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Pasta, Side dish, Snack, Supper",
    "recipeIngredients": [
      "300g fusilli pasta spirals – or you can use farfalle (butterflies) or penne (quill tubes)",
      "225g bag prepared fresh baby  spinach",
      "250g punnet cherry  tomatoes halved",
      "100g black olive (we bought kalamata from the deli counter)",
      "200g   feta cheese broken into rough chunks",
      "3 tbsp olive oil"
    ],
    "recipeInstructions": [
      {
        "text": "Tip the fusilli into a large pan of boiling salted water and boil for 10 minutes. Throw in the spinach, stir well and boil for another 2 minutes. Drain into a colander or sieve and leave to drip-dry."
      },
      {
        "text": "Tip the tomatoes, olives and feta into a big bowl, grind lots of black pepper over and then drizzle with the olive oil."
      },
      {
        "text": "Toss in the drained pasta and spinach, and let everyone help themselves."
      }
    ]
  },
  {
    "name": "Herby cheese roast chicken & baked tomatoes",
    "description": "We've turned a classic roast into a summery al fresco meal - we can guarantee it's a winning recipe, unfortunately we can't guarantee the weather!",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9618_11-6a1b378.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/herby-cheese-roast-chicken-baked-tomatoes",
    "keywords": " Josh Eagleton, 4 servings, 800 kcal or less, Al fesco, Barney Desmazery, Chicken, Free range, Mains, Over an hour, Roast chicken, Summery, Sunday lunch, Sunday roast, Vine tomato, Vine tomatoes",
    "cookTime": "PT1H40M",
    "totalTime": "PT1H50M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "689 calories",
      "fatContent": "52 grams fat",
      "saturatedFatContent": "20 grams saturated fat",
      "carbohydrateContent": "5 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "50 grams protein",
      "sodiumContent": "0.85 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Main course, Supper",
    "recipeIngredients": [
      "1 free-range chicken",
      "1 tbsp olive oil",
      "500g small vine tomato",
      "150g pack garlic & herb  soft cheese"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 190C/fan 170C/gas 5. Carefully loosen the skin of the chicken as above, then push the cheese under the skin and massage it down so it completely covers the breasts and is pushed down to the legs."
      },
      {
        "text": "Sit the chicken in a roasting tin, drizzle with the olive oil, then roast, undisturbed, for 1 hr 20 mins. When the chicken is done, remove from the tin and leave to rest for 20 mins. While the chicken is resting, toss the tomatoes in the roasting tin with the chicken juices, then cook until the chicken is ready to serve. Serve the chicken in pieces with a few baked tomatoes, some of the pan juices, and a green salad."
      }
    ]
  },
  {
    "name": "Spicy chicken & veg stir-fry",
    "description": "Asian dishes are easy to throw together, full of flavour and packed with veg, The perfect quick meal for the health conscious foody",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10344_11-69cb01e.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/spicy-chicken-veg-stir-fry",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 400 kcal or less, Asian, Cashew, Cashews, Chicken, Chicken breast, Chicken breasts, Chinese, Good Food, Mains, Oyster sauce, Quick, Red chilli, Red chillies, Soy sauce, Stir fry",
    "cookTime": "PT15M",
    "totalTime": "PT25M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "272 calories",
      "fatContent": "8 grams fat",
      "saturatedFatContent": "1 grams saturated fat",
      "carbohydrateContent": "13 grams carbohydrates",
      "sugarContent": "11 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "38 grams protein",
      "sodiumContent": "2.67 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "400g mixed green vegetable",
      "1 tbsp sunflower oil",
      "4 skinless chicken breasts sliced",
      "1 red chilli desseded and sliced",
      "120g sachet stir-fry oyster sauce (see below)",
      "1 tbsp soy sauce",
      "25g toasted  cashew or more if you like",
      "bunch spring onions sliced"
    ],
    "recipeInstructions": [
      {
        "text": "Bring a pan of salted water to the boil, cook the green vegetables for 2 mins only, then drain."
      },
      {
        "text": "Heat the oil in a large frying pan or wok, then fry the chicken slices for 4 mins until almost cooked. Add the drained green veg, chilli, stir-fry sauce and soy sauce. Stir-fry briefly to heat everything through and to finish cooking the chicken. Mix in the cashews and spring onions, then serve."
      }
    ]
  },
  {
    "name": "Really easy beefburgers",
    "description": "Perfect for getting the kids cooking, these burgers are fun to make, freeze well and are super tasty too",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10114_10-b52a8f1.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/really-easy-beefburgers",
    "keywords": " Josh Eagleton, 4 servings, 600 kcal or less, Barbecue, BBQ, Beefburgers, Burger bun, Burger buns, Burgers, Cheddar, Chilli powder, Kids cooking, Lettuce, Lettuces, Mains, Make ahead, Mayonnaise, Mince, Over an hour, Sara Buenfeld",
    "cookTime": "PT35M",
    "totalTime": "PT1H5M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "496 calories",
      "fatContent": "27 grams fat",
      "saturatedFatContent": "12 grams saturated fat",
      "carbohydrateContent": "26 grams carbohydrates",
      "sugarContent": "2 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "39 grams protein",
      "sodiumContent": "1.53 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Main course, Supper",
    "recipeIngredients": [
      "500g pack lean minced beef preferably organic",
      "1 tsp mild chilli powder",
      "4 slices mild cheddar if you want to make cheeseburgers",
      "4 burger buns",
      "choice of lettuce cucumber, gherkin, tomato and red onion",
      "ketchup or mayonnaise or both"
    ],
    "recipeInstructions": [
      {
        "text": "Flavour the meat: Put the meat in a mixing bowl, then sprinkle over the chilli powder and a little salt and pepper. Mix well with your hands or use a fork. The mild chilli powder gives the meat added flavour without making it too spicy."
      },
      {
        "text": "Shape into burgers: Divide the mixture into 4 equal pieces, then shape with your hands into round burgers about the width of the buns, or pack the mixture into large presentation rings (if you have them) placed on a chopping board. You need to press down on the meat to compact it, then carefully lift off the rings – a bit like making sandcastles."
      },
      {
        "text": "Now get cooking: Fry the burgers on a hot griddle or grill them outside on the barbecue for 5 mins on each side, turning them carefully with a metal spatula. Take care as hot fat from the meat may spit a little."
      },
      {
        "text": "Top with cheese and toast the buns: If you want to make cheeseburgers, put a slice of cheese on top of the burgers when you turn them over and let it melt while the other side cooks. When they are ready, cut the burger baps in half and warm them in the toaster or on the barbecue - take care that you don’t burn them."
      },
      {
        "text": "Prepare the toppings: Meanwhile, prepare the toppings of your choice. Separate the lettuce into leaves. Then, using a sharp knife, thinly slice the tomato, cucumber and gherkin on a separate board to the one you prepared the burgers on. Peel and finely chop the red onion."
      },
      {
        "text": "Assemble and enjoy: Spread a little mayonnaise or ketchup - or both if you like - onto the toasted buns, then top with your burgers and salads of your choice, followed by the remaining half bun."
      }
    ]
  },
  {
    "name": "Gooseberry gems",
    "description": "Gooseberries are often overlooked, but it’s just a matter of knowing how to cook them and how to dress them up",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10123_11-6e8a526.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/gooseberry-gems",
    "keywords": "Buns, CAKE, Cakes, Crème fraîche, Elderflower cordial, Fairy cakes, Gooseberries, Gooseberry, Jane Hornby, Make ahead, Natural yogurt",
    "cookTime": "PT20M",
    "totalTime": "PT30M",
    "recipeYield": "Makes 12",
    "nutrition": {
      "calories": "370 calories",
      "fatContent": "21 grams fat",
      "saturatedFatContent": "13 grams saturated fat",
      "carbohydrateContent": "43 grams carbohydrates",
      "sugarContent": "29 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "5 grams protein",
      "sodiumContent": "0.61 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Treat",
    "recipeIngredients": [
      "225g self-raising flour",
      "1 tsp baking powder",
      "200g golden caster sugar",
      "3 eggs",
      "150g pot natural yogurt",
      "4 tbsp elderflower cordial (we used Bottlegreen)",
      "175g butter melted and cooled",
      "330g gooseberry topped and tailed, or use frozen",
      "50g golden caster sugar",
      "1 tbsp elderflower cordial",
      "200g crème fraîche",
      "icing sugar for dusting"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 200C/fan 180C/gas 6. Put 12 muffin cases into a muffin tray. Mix the dry ingredients together in a large bowl. Beat the eggs, yogurt, elderflower cordial and melted butter together with a pinch of salt, then stir into the dry ingredients. Spoon into the cases (they will be quite full), bake for 18-20 mins until risen and golden, then cool on a wire rack."
      },
      {
        "text": "Meanwhile, put the gooseberries and the sugar into a frying pan, then gently cook for 10 mins until most of the berries have collapsed, but there’s still some texture. Taste for sweetness (add more sugar if you like, but remember that the cakes are sweet), then stir in the elderflower cordial and allow to cool. Once cool, fold into the crème fraîche."
      },
      {
        "text": "To serve, cut a section out of the top of each cake using a small, serrated knife - heart shapes look sweet, but if that’s too fiddly simply cut off the top and cut in half, like a butterfly cake. Spoon a dessertspoonful or so of the fool into each cake, top with the piece that you cut away, then dust with a little icing sugar."
      }
    ]
  },
  {
    "name": "Cherries in rosé wine & vanilla syrup",
    "description": "This light, fresh-tasting dessert looks elegant served in individual glasses. Top it with a spoonful of mascarpone for the perfect finish",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10138_11-850a470.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/cherries-rose-wine-vanilla-syrup",
    "keywords": " Josh Eagleton, 10-30 minutes, 200 kcal or less, 30-60 minutes, 4 servings, Al fresco, Cherries, Cherry, Dessert, Desserts, Make ahead, Mary Cadogan, Pudding, Quick, Summer, Vanilla pod, Vanilla pods",
    "cookTime": "PT20M",
    "totalTime": "PT30M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "199 calories",
      "carbohydrateContent": "43 grams carbohydrates",
      "sugarContent": "43 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "1 grams protein",
      "sodiumContent": "0.02 milligram of sodium"
    },
    "recipeCategory": "Dessert",
    "recipeIngredients": [
      "425ml rosé wine",
      "1 vanilla pod split lengthways",
      "100g demerara sugar",
      "500g cherry"
    ],
    "recipeInstructions": [
      {
        "text": "Tip the wine into a medium pan, then add the vanilla pod to the pan with the sugar. Bring to the boil, then reduce the heat and simmer until the sugar has dissolved."
      },
      {
        "text": "Stone the cherries if you want, or leave them as they are. Add to the pan and cook gently for 6 mins. Remove with a slotted spoon to a bowl. Increase the heat, then boil the liquid for 8-10 mins until slightly syrupy. Pour over the cherries and serve warm or cold in glass bowls."
      }
    ]
  },
  {
    "name": "Cherry vodka",
    "description": "We say make it a double! This is perfect chilled, with a few cherries in, or make it long and add some soda or lemonade",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2008/06/cherry-vodka-052fe24.jpg?resize=768,698",
        "width": 768,
        "height": 698
      },
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2008/06/cherry-vodka-052fe24.jpg?resize=1366,1242",
        "width": 1366,
        "height": 1242
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/cherry-vodka",
    "keywords": "Alcohol, Beginners, Booze, Boozy, Cherries, Cherry, Make ahead, Mary Cadogan, Vodka",
    "totalTime": "PT10M",
    "recipeYield": "Makes 750ml",
    "nutrition": {
      "calories": "169 calories",
      "carbohydrateContent": "15 grams carbohydrates",
      "sugarContent": "15 grams sugar",
      "sodiumContent": "0.03 milligram of sodium"
    },
    "recipeCategory": "Drink",
    "recipeIngredients": [
      "400g cherry",
      "200g caster sugar",
      "70cl  bottle vodka"
    ],
    "recipeInstructions": [
      {
        "text": "Slit the cherries, but don’t cut them in half."
      },
      {
        "text": "Put in a pan with the sugar and 150ml water, then heat, stirring gently, until the juices run and the sugar has dissolved."
      },
      {
        "text": "Remove from the heat, then spoon into a large bottle or jar."
      },
      {
        "text": "Add the vodka and mix well. Seal, then leave for 4 weeks before drinking to let the flavours steep. For ice cold vodka, keep the bottle in the freezer (it won’t freeze solid) or simply decant into a carafe, if you like."
      }
    ]
  },
  {
    "name": "Cherry crumble pies",
    "description": "These little crumble pies just beg to covered in custard or dolloped with clotted cream. One just isn’t enough",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10218_11-736b66c.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/cherry-crumble-pies",
    "keywords": " Josh Eagleton, 30-60 minutes, 400 kcal or less, Cakes, Cherries, Cherry, Crumble, Hazelnut, Hazelnuts, Jam, Mains, Mary Cadogan, Over an hour, Pies, Tarts",
    "cookTime": "PT30M",
    "totalTime": "PT1H",
    "recipeYield": "Makes 12",
    "nutrition": {
      "calories": "257 calories",
      "fatContent": "15 grams fat",
      "saturatedFatContent": "7 grams saturated fat",
      "carbohydrateContent": "29 grams carbohydrates",
      "sugarContent": "15 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "3 grams protein",
      "sodiumContent": "0.19 milligram of sodium"
    },
    "recipeCategory": "Dessert, Dinner, Supper, Treat",
    "recipeIngredients": [
      "200g plain flour",
      "50g ground hazelnut",
      "140g cold butter cubed",
      "50g caster sugar",
      "3 tbsp raspberry jam or bramble jelly",
      "500g cherry stoned",
      "50g hazelnut roughly chopped",
      "2 tbsp demerara sugar"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 190C/fan 170C/gas 5. Tip the flour and hazelnuts into a food processor, then add the butter. Process to fine crumbs, add the sugar, then mix briefly. Remove 3 rounded tbsp of the mixture and put in a separate bowl. Add 1-2 tbsp cold water to the food processor, then pulse to form a firm dough. Tip out onto a lightly floured surface and knead briefly. If the dough is soft, wrap in cling film and chill for 20 mins."
      },
      {
        "text": "Roll out the dough and stamp out rounds using a 10-12cm cutter. You should get 12 rounds in total from the dough – you will need to gather and re-roll the trimmings. Use to line 12 x 7-8 cm tartlet tins or the 12 holes of a muffin tin."
      },
      {
        "text": "Warm the jelly in a pan until it melts a little, then stir in the cherries. Divide between the pastry cases. Stir the chopped hazelnuts and sugar into the reserved pastry mix, then sprinkle over the cherries. Bake for 25-30 mins until the pastry and crumble are lightly browned and the cherries cooked. Leave to cool for 10 mins in the tins, then carefully remove – you may need to loosen the edges of the pies with a small, sharp pointed knife, then invert them onto plates and quickly flip the right way up. Serve warm or cold."
      }
    ]
  },
  {
    "name": "Sardines with Sicilian fennel salad",
    "description": "Perfect on the barbecue, sardines add a taste of summer to any meal and are the perfect addition to an al fresco salad",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10222_12-b434b36.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/sardines-sicilian-fennel-salad",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 30-60 minutes, 800 kcal or less, Barbecue, Barbeque, Barbie, BBQ, Fennel, Fennel bulb, Fennel bulbs, Fish, Green olive, Green olives, Mains, Mary Cadogan, Parsley, Pine nut, Pine nuts, Quick, Raisin, Raisins, Sardine, Sardines, Seafood",
    "cookTime": "PT10M",
    "totalTime": "PT30M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "663 calories",
      "fatContent": "50 grams fat",
      "saturatedFatContent": "7 grams saturated fat",
      "carbohydrateContent": "20 grams carbohydrates",
      "sugarContent": "20 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "34 grams protein",
      "sodiumContent": "1.49 milligram of sodium"
    },
    "recipeCategory": "Buffet, Main course, Snack, Supper",
    "recipeIngredients": [
      "zest and juice 1 lemon",
      "bunch parsley half the leaves kept whole, the other half finely chopped",
      "1 small garlic clove finely chopped",
      "1 fennel bulb with fronds",
      "50g toasted  pine nut",
      "50g raisin",
      "handful green olives chopped",
      "3 tbsp olive oil",
      "4 large  sardines scaled and gutted"
    ],
    "recipeInstructions": [
      {
        "text": "Mix the lemon zest, chopped parsley and garlic together, then set aside. Pick the fronds from the fennel and set aside. Halve the fennel bulb and finely slice. Make the salad by mixing the sliced fennel and fronds with the pine nuts, raisins, olives, and whole parsley leaves. Dress with the olive oil and lemon juice."
      },
      {
        "text": "Heat the griddle pan or barbecue. Season the fish with rock salt (this stops them sticking). Griddle for 2-3 mins on each side until the eyes turn white. Sprinkle the fish with the parsley mix and lift onto plates. Drizzle with oil and serve with the salad."
      }
    ]
  },
  {
    "name": "Cold roast beef with beetroot salad & horseradish cream",
    "description": "Turn your leftover Sunday roast into this impressive Monday night salad",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10287_11-a797bb4.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/cold-roast-beef-beetroot-salad-horseradish-cream",
    "keywords": "Barney Desmazery, Beef, Beetroot, Crème fraîche, Frisée, Horseradish, Leftovers, Micro-leaf, Micro-leaves, Mustard, Roast beef, Salad, Shallot, Shallots, Sherry vinegar",
    "totalTime": "PT20M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "394 calories",
      "fatContent": "26 grams fat",
      "saturatedFatContent": "9 grams saturated fat",
      "carbohydrateContent": "7 grams carbohydrates",
      "sugarContent": "6 grams sugar",
      "fiberContent": "26 grams fiber",
      "proteinContent": "29 grams protein",
      "sodiumContent": "0.26 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "thin slices  leftover roast beef",
      "3 small cooked beetroot sliced, then cut into fine matchsticks",
      "1 shallot finely chopped",
      "4 handfuls of a mix of bitter leaves, such as  frisée mizuna and watercress",
      "1 tbsp sherry vinegar",
      "4 tbsp olive oil",
      "selection  of micro-leaves if you can get them",
      "5 tbsp grated horseradish",
      "4 tbsp crème fraîche",
      "pinch mustard powder",
      "juice 1⁄2 lemon"
    ],
    "recipeInstructions": [
      {
        "text": "To make the horseradish cream, whisk all the ingredients together with salt and pepper until spoonable, then set aside. Lay the slices of beef on four serving plates. In a bowl, mix the beetroot, shallot and salad leaves together. Dress with the sherry vinegar and 3 tbsp of the olive oil, then gently toss."
      },
      {
        "text": "Neatly pile a mound of salad into the centre of each plate and scatter some microleaves around the outside. Top the salad with a neat spoonful of horseradish cream, drizzle with the remaining olive oil and serve."
      }
    ]
  },
  {
    "name": "Middle Eastern bread & goat’s cheese salad",
    "description": "Barney's version of fattoush – a classic Middle Eastern bread salad. Fattoush doesn’t normally contain goat’s cheese, but it turns it into more of a main meal",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10292_11-8708f0f.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/middle-eastern-bread-goats-cheese-salad",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 600 kcal or less, Baby gem lettuce, Baby Gem lettuces, Barney Desmazery, Cos lettuce, Cos lettuces, Cucumber, Cucumbers, Fattoush, Goat's Cheese, Mains, Make ahead, Middle Eastern, Mint, Pita, Pitta, Plum tomato, Plum tomatoes, Quick, Radish, Radishes, Red onion, Red onions, Rocket, Salad",
    "cookTime": "PT5M",
    "totalTime": "PT25M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "418 calories",
      "fatContent": "26 grams fat",
      "saturatedFatContent": "11 grams saturated fat",
      "carbohydrateContent": "26 grams carbohydrates",
      "sugarContent": "7 grams sugar",
      "fiberContent": "4 grams fiber",
      "proteinContent": "17 grams protein",
      "sodiumContent": "1.32 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Main course, Side dish, Supper",
    "recipeIngredients": [
      "2 pitta breads",
      "1 garlic clove",
      "juice 1 lemon",
      "3 ripe plum tomatoes cut into chunks",
      "1⁄2  cucumber cut into chunks",
      "6 radishes sliced",
      "1 small red onion halved and sliced",
      "large handful mint leaves, very roughly chopped",
      "1 small Cos lettuce roughly chopped",
      "1 Baby Gem lettuce roughly chopped",
      "2 large handfuls  rocket",
      "5 tbsp olive oil",
      "200g firm  goat's cheese crumbled into large chunks"
    ],
    "recipeInstructions": [
      {
        "text": "Cook the pitta bread on a griddle or in a toaster until brown and crisp. When cool enough to handle, tear into bite-size pieces."
      },
      {
        "text": "Mash the garlic clove with a pinch of salt, then tip into a large bowl and stir in the lemon juice. Tip all the other ingredients, except the olive oil and goat’s cheese, into the bowl, then drizzle over the oil. Gently toss everything together until mixed and dressed. Serve the salad in piles with goat’s cheese crumbled over each serving."
      }
    ]
  },
  {
    "name": "Rice & peas with mango chicken",
    "description": "Affordable, tasty and filling, this Lesley Waters dish will become a family favourite",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10316_11-8aaaa55.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/rice-peas-mango-chicken",
    "keywords": " Josh Eagleton, 30-60 minutes, 4 servings, 800 kcal or less, Bean, Beans, Black-eyed bean, Black-eyed beans, Chicken breast, Chicken breasts, Coconut milk, Dinner, Family, Kidney bean, Kidney beans, Lesley Waters, Lime, Limes, Long grain rice, Mains, Onion, Onions, Petits pois, Pulse, Pulses, Thyme",
    "cookTime": "PT30M",
    "totalTime": "PT40M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "702 calories",
      "fatContent": "20 grams fat",
      "saturatedFatContent": "7 grams saturated fat",
      "carbohydrateContent": "86 grams carbohydrates",
      "sugarContent": "19 grams sugar",
      "fiberContent": "11 grams fiber",
      "proteinContent": "50 grams protein",
      "sodiumContent": "2.55 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course",
    "recipeIngredients": [
      "6 tbsp mango chutney",
      "zest and juice 2 limes",
      "4 skinless chicken breasts",
      "4 tbsp olive oil",
      "1 onion chopped",
      "2 garlic cloves crushed",
      "200g long grain rice",
      "400g can  kidney bean drained and rinsed",
      "400g can  black-eyed bean drained and rinsed",
      "500ml vegetable stock",
      "1 thyme sprig, leaves stripped",
      "175g frozen petits pois",
      "200ml reduced-fat coconut milk"
    ],
    "recipeInstructions": [
      {
        "text": "Make the rice and peas: heat 2 tbsp oil in a large frying pan, then fry onion for 5 mins. Add the garlic, then stir in the rice. Cook for 1 min more. Add the beans, pour in the stock and coconut milk and season well. Bring to the boil, cover, then simmer gently for 25-30 mins or until the rice is just cooked. Add the thyme and petit pois for the final 3 mins of cooking, then fluff up with a fork."
      },
      {
        "text": "Meanwhile, mix the mango chutney, lime zest and juice and remaining olive oil, then season well. Heat a griddle or frying pan, brush a little of the mix over the chicken breasts, then cook for 5 mins each side until charred and cooked through. Once done, set aside to rest for a few mins while you heat the rest of the mango mix in the pan. Serve the rice and peas with a chicken breast and spoonfuls of tangy mango sauce."
      }
    ]
  },
  {
    "name": "Roast carrot & bean salad with feta",
    "description": "Get all of your 5-a-day with this super healthy salad. Tasty, easy and perfect for lunch leftovers",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10320_10-906d965.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/roast-carrot-bean-salad-feta",
    "keywords": " Josh Eagleton, 30-60 minutes, 4 servings, 400 kcal or less, 5-a-day, Cannellini bean, Cannellini beans, Carrot, Chantenay, Feta cheese, Green bean, Green beans, Lemon thyme, Lesley Waters, Mains, Make ahead, Red onion, Red onions, Salad",
    "cookTime": "PT30M",
    "totalTime": "PT40M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "395 calories",
      "fatContent": "21 grams fat",
      "saturatedFatContent": "8 grams saturated fat",
      "carbohydrateContent": "36 grams carbohydrates",
      "sugarContent": "19 grams sugar",
      "fiberContent": "12 grams fiber",
      "proteinContent": "18 grams protein",
      "sodiumContent": "3.1 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Main course, Supper",
    "recipeIngredients": [
      "1kg Chantenay or baby carrots",
      "few lemon thyme sprigs (optional)",
      "2 tbsp olive oil",
      "175g green bean topped and halved",
      "400g can butter or cannellini bean drained and rinsed",
      "1 small red onion halved and finely sliced",
      "200g pack feta cheese crumbled",
      "small  bunch mint"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 220C/fan 200C/gas 7. Put the carrots into a large roasting tin, toss with the lemon thyme (if using) and half the oil, then season well. Roast for about 30 mins until golden, turning halfway through cooking."
      },
      {
        "text": "Meanwhile, cook the green beans in boiling water for 2 mins. Drain, cool under cold running water, then drain again. Mix together the green beans, cannellini or butter beans, remaining oil, onion and feta, then season to taste. Toss with the hot carrots, then tear in the mint just before serving."
      }
    ]
  },
  {
    "name": "Steak sandwich on a plate",
    "description": "Prepare your steak sandwich ingredients separately and let your guests assemble it themselves",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10363_10-f7ec2d9.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/steak-sandwich-plate",
    "keywords": " Josh Eagleton, Blue cheese, Dressing, Father's day, Good Food, Indulgent, Red onion, Red onions, Romaine lettuce, Romaine lettuces, Rump, Sandwich, Sirloin, Steak, Steaks, Tomato, Tomatoes, Usa, White bread",
    "cookTime": "PT10M",
    "totalTime": "PT25M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "672 calories",
      "fatContent": "37 grams fat",
      "saturatedFatContent": "13 grams saturated fat",
      "carbohydrateContent": "41 grams carbohydrates",
      "sugarContent": "10 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "46 grams protein",
      "sodiumContent": "1.91 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "1⁄2 romaine lettuce chopped",
      "1 small red onion sliced",
      "2 tomatoes chopped into chunks",
      "50g blue cheese",
      "2 steaks sirloin or rump, both work nicely",
      "4 small slices rustic white bread - sourdough is perfect",
      "1 garlic clove halved",
      "3 tbsp bought mustard dressing or make your own (see below)"
    ],
    "recipeInstructions": [
      {
        "text": "Mix the lettuce, onion, tomato and blue cheese together in a bowl and set aside."
      },
      {
        "text": "Heat a griddle or barbecue until hot. Season the steaks with a little salt and generously with pepper, then cook for 2 mins on each side for medium-rare, or until done to your liking. Remove the steaks to a plate to rest for a few mins. Meanwhile, toast the bread on the griddle or barbecue until crisp on both sides, then rub well with the garlic. Toss the salad with the mustard dressing and serve alongside the steak and warm, garlicky bread."
      }
    ]
  },
  {
    "name": "Spiced tortilla",
    "description": "Perfect for dinners, lunches and snacks, this spiced tortilla is a great in-the-fridge standby for many occasions",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10375_11-bf81bd0.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/spiced-tortilla",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 400 kcal or less, Cherry tomato, Cherry tomatoes, Coriander, Good Food, Mains, Make ahead, Mediterranean, Potato, Potatoes, Quick, Red chilli, Red chillies, Spanish, Spice, Spices, Tapas, Tortilla",
    "cookTime": "PT20M",
    "totalTime": "PT25M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "327 calories",
      "fatContent": "17 grams fat",
      "saturatedFatContent": "4 grams saturated fat",
      "carbohydrateContent": "27 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "19 grams protein",
      "sodiumContent": "0.69 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Main course, Side dish, Snack, Supper",
    "recipeIngredients": [
      "1 tbsp sunflower oil",
      "1 onion sliced",
      "1 red chilli deseeded and shredded",
      "2 tsp curry spice (we used coriander, cumin and turmeric)",
      "300g cherry tomato",
      "500g cooked potato sliced",
      "bunch coriander stalks finely chopped, leaves roughly chopped",
      "8 eggs beaten"
    ],
    "recipeInstructions": [
      {
        "text": "Heat the oil in a large frying pan. Fry the onion and half the chilli for 5 mins until softened. Tip in the spices, fry for 1 min more, then add the cherry tomatoes, potatoes and coriander stalks to the pan. Season the eggs well, pour over the top of the veg and leave to cook gently for 8-10 mins until almost set."
      },
      {
        "text": "Heat the grill and flash the tortilla underneath for 1-2 mins until the top is set. Scatter the coriander leaves and remaining chilli over the top, slice into wedges and serve with a green salad."
      }
    ]
  },
  {
    "name": "Summery mushroom & truffled herb salad",
    "description": "A drizzle of truffle oil turns mushrooms on toast into an elegant starter, says associate food editor Barney Desmazery",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10380_12-94528da.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/summery-mushroom-truffled-herb-salad",
    "keywords": " Josh Eagleton, 30-60 minutes, 4 servings, 400 kcal or less, Broad bean, Broad beans, Dinner party, Good Food, Herb, Herbs, Mains, Mushroom, Salad, Shiitake mushroom, Shiitake mushrooms, Sourdough bread, Summer, Truffle oil",
    "cookTime": "PT20M",
    "totalTime": "PT40M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "343 calories",
      "fatContent": "24 grams fat",
      "saturatedFatContent": "4 grams saturated fat",
      "carbohydrateContent": "18 grams carbohydrates",
      "sugarContent": "1 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "14 grams protein",
      "sodiumContent": "0.53 milligram of sodium"
    },
    "recipeCategory": "Dinner, Snack, Starter, Supper",
    "recipeIngredients": [
      "1 tbsp white wine vinegar",
      "4 eggs",
      "4 tbsp olive oil",
      "4 thin slices sourdough bread",
      "2 garlic cloves 1 whole, 1 finely chopped",
      "300g oyster and shiitake mushroom",
      "200g podded broad bean shelled",
      "juice 1 lemon",
      "large handful mixed, soft herb such as chervil, parsley, basil, chives and tarragon",
      "2 tbsp truffle oil"
    ],
    "recipeInstructions": [
      {
        "text": "Tip the vinegar into a shallow pan of boiling water, poach the eggs, then set aside in a bowl of iced water. Heat half the oil in a frying pan, fry the bread until golden on each side, then rub with the whole garlic clove."
      },
      {
        "text": "Reheat the pan until really hot, add the rest of the oil, throw in the mushrooms, then fry for 2-3 mins. Add the chopped garlic, broad beans and lemon juice, then set aside. Reheat the eggs briefly in the cooking water, then toss most of the herbs through the mushrooms."
      },
      {
        "text": "To serve, put a slice of toast on each plate, spoon over mushrooms and top with an egg. Drizzle with truffle oil, scatter with the rest of the herbs, then finish with black pepper."
      }
    ]
  },
  {
    "name": "Courgette & watercress salad with grilled fish & herbed aïoli",
    "description": "Cooking fish and teaming it with salad is perfect for a summer's day, plus we'll show you a simple, quick way to make aïoli",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10396_11-5376623.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/courgette-watercress-salad-grilled-fish-herbed-aioli",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 800 kcal or less, Aioli, Al fresco, Dijon mustard, Dinner party, Egg yolk, Egg yolks, Entertaining, Fish, Herb, Herbs, Jane Hornby, Main course, Mains, Mayonnaise, Mint, Quick, Seafood, Summer, Summery, Watercress, White fish",
    "cookTime": "PT10M",
    "totalTime": "PT20M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "605 calories",
      "fatContent": "52 grams fat",
      "saturatedFatContent": "8 grams saturated fat",
      "carbohydrateContent": "2 grams carbohydrates",
      "sugarContent": "2 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "32 grams protein",
      "sodiumContent": "0.37 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "about 12 baby  courgettes",
      "olive oil",
      "4 fillets white fish skin on",
      "juice 1⁄2 lemon",
      "bunch mint leaves picked",
      "100g bag watercress (or use rocket)",
      "2 egg yolks",
      "1 tsp Dijon mustard",
      "1 fat garlic clove",
      "200ml mild olive oil",
      "lemon juice to taste",
      "handful mixed soft herb (such as chives, parsley, mint, and dill) chopped, plus extra leaves to serve"
    ],
    "recipeInstructions": [
      {
        "text": "Heat a griddle pan. Rub courgettes in 1 tsp oil, season, then griddle until just soft. Set aside while you make the aïoli. Whizz egg yolks in a processor with the mustard, garlic and plenty of salt. Gradually add the oil until thick, then season with lemon juice. You can make this with a stick blender (see Know-how, above right). It will keep for a day in the fridge."
      },
      {
        "text": "Season the fish. Heat a non-stick frying pan until very hot, add 1 tsp oil, then fry the fish, skin-side down, for 3 mins until crisp. Turn and fry the fish for just 30 secs-1 min more until it is cooked all the way through."
      },
      {
        "text": "To serve, fold the herbs into the aïoli. Whisk 1 tbsp oil with the lemon juice, season, then use to very lightly dress the courgettes, mint and watercress. Pile onto plates, top with fish plus a dollop of aïoli, then scatter with herbs."
      }
    ]
  },
  {
    "name": "Cherry swirl cheesecake",
    "description": "Swirls of cherries ensure this sublime cheesecake has a summer flavour, perfect for a sunset dinner party outside",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10143_11-f2468a4.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/cherry-swirl-cheesecake",
    "keywords": "Cheery, Cheesecake, Cornflour, Crème fraîche, Dinner party, Golden syrup, Indulgent, Make ahead, Mary Cadogan, Orange, Oranges, Shortbread, Shortbreads, Soft cheese, Summer",
    "cookTime": "PT45M",
    "totalTime": "PT1H25M",
    "recipeYield": 8,
    "nutrition": {
      "calories": "506 calories",
      "fatContent": "31 grams fat",
      "saturatedFatContent": "19 grams saturated fat",
      "carbohydrateContent": "51 grams carbohydrates",
      "sugarContent": "41 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "10 grams protein",
      "sodiumContent": "0.3 milligram of sodium"
    },
    "recipeCategory": "Dessert, Dinner, Treat",
    "recipeIngredients": [
      "50g butter plus extra for greasing",
      "140g shortbread biscuits",
      "1 tbsp golden syrup",
      "350g cherry 200g of them stoned",
      "225g caster sugar",
      "500g medium-fat  soft cheese",
      "1 tbsp cornflour",
      "2 eggs",
      "1 tsp vanilla extract",
      "zest 1 orange",
      "200ml tub crème fraîche",
      "icing sugar for dusting"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 160C/fan 140C/gas 3. Butter a loose-based 20cm cake tin and line the base with baking parchment. Break up the biscuits, then pulse to fine crumbs in a food processor. Melt the butter with the syrup, then stir into the crumbs until they are evenly damp. Tip into the prepared tin and smooth with the back of a dessertspoon. Bake for 10 mins, then leave to cool. Reduce oven temperature to 150C/fan 130C/gas 2."
      },
      {
        "text": "Tip the stoned cherries into the rinsed-out food processor with 85g of the sugar. Blend until smooth, then tip into a small pan and bring to the boil. Simmer for 5-6 mins, stirring, until it forms a thick syrup. Cool."
      },
      {
        "text": "Rinse out the food processor again, then tip in the cheese, cornflour, eggs, remaining sugar, vanilla, orange and half the crème fraîche. Blend until smooth. Spoon half the mix into the tin, then spoon half the cherry purée evenly over the top. Spoon the remaining cheesecake mix over this. Stir the mix gently with a fine skewer to swirl the cherry purée through it. Bake for 45 mins, then turn the oven off and leave for 30 mins."
      },
      {
        "text": "Spread the remaining crème fraîche over the filling, then spoon the remaining cherry purée into the centre. Using a fine skewer draw the cherry purée through the crème fraîche to make a star pattern, wiping the skewer each time. Set the reserved cherries around the edge of the cheesecake, then dust with icing sugar. Chill until ready to serve."
      }
    ]
  },
  {
    "name": "Garlic prawns with puy lentils",
    "description": "Don't dismiss lentils too quickly - they're filling, healthy and easy to combine with other flavours, as this dish proves.",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10323_11-2ebd5fd.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/garlic-prawns-asian-puy-lentils",
    "keywords": " Josh Eagleton, 30-60 minutes, 4 servings, 400 kcal or less, Clear honey, Lentil, Lentils, Lesley Waters, Lime, Limes, Mains, Prawns, Puy lentils, Red chilli, Red chillies, Rice wine vinegar, Sesame seed, Sesame seeds, Soy sauce, Tiger prawns",
    "cookTime": "PT20M",
    "totalTime": "PT35M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "349 calories",
      "fatContent": "12 grams fat",
      "saturatedFatContent": "2 grams saturated fat",
      "carbohydrateContent": "29 grams carbohydrates",
      "sugarContent": "4 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "33 grams protein",
      "sodiumContent": "1.89 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "400g raw, peeled tiger prawn defrosted if frozen",
      "2 red chillies deseeded and finely chopped",
      "zest and juice 1 lime",
      "2 large garlic cloves crushed",
      "2 tbsp oil",
      "200g Puy lentil",
      "2 tbsp soy sauce",
      "1 tbsp clear honey",
      "1 tbsp rice wine vinegar",
      "3 tbsp sesame seed toasted",
      "bunch coriander leaves roughly chopped"
    ],
    "recipeInstructions": [
      {
        "text": "Place the prawns in a shallow dish. Mix together half the finely chopped chilli, lime zest and juice, garlic and oil, then pour over the prawns. Cover and chill for 20 mins to marinate."
      },
      {
        "text": "Meanwhile, put the lentils in a pan, cover with twice their depth in water, bring to the boil, then simmer for 15-20 mins until tender. Top up the water if you need to."
      },
      {
        "text": "To make the dressing, put the remaining chopped chilli, the soy, honey and vinegar into a small bowl and stir together. Drain the lentils, then tip into a large bowl. Spoon over almost all the dressing while the lentils are hot, tip in the sesame seeds, then mix well."
      },
      {
        "text": "Heat a frying pan until really hot. Lift the prawns out of the marinade, then fry for 1-2 mins each side until pink and lightly golden. Pour in the marinade and bring to the boil. Fold the chopped coriander through the lentils, then spoon onto serving plates. Top with the prawns and any pan juices."
      }
    ]
  },
  {
    "name": "Speedy noodle soup",
    "description": "Don't let a lack of time ruin your evening meal, this speedy supper is easy to whip up at the last minute",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10331_12-b3e62f6.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/speedy-noodle-soup",
    "keywords": "Asian, Beginners, Chilli paste, Chinese, Good Food, Noodles, Peanut, Peanuts, Quick, Soup, Soy sauce",
    "cookTime": "PT5M",
    "totalTime": "PT10M",
    "recipeYield": 1,
    "recipeCategory": "Dinner, Lunch, Main course, Snack, Supper",
    "recipeIngredients": [
      "330ml stock (any you like)",
      "squeeze chilli paste to taste",
      "2 tsp soy sauce (or veggie alternative)",
      "1 sheet straight-to-wok noodle",
      "handful stir-fry vegetable",
      "crushed peanut"
    ],
    "recipeInstructions": [
      {
        "text": "Bring the stock to the boil in a saucepan, stir in a squeeze chilli paste and soy sauce, then drop in 1 sheet straight-to-wok noodles."
      },
      {
        "text": "Simmer for a few mins until all the noodles have separated."
      },
      {
        "text": "Add a handful stir-fry veg, reserving any leafy bits until later."
      },
      {
        "text": "Simmer for 1 min until the veg is just tender. Stir in the leafy veg, then simmer for 1 min more."
      },
      {
        "text": "Serve in a deep bowl, scattered with crushed peanuts."
      }
    ]
  },
  {
    "name": "Crunchy Coronation chicken salad",
    "description": "Ready in a flash and healthy too. Put those take away menus back where you found them!",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10336_12-51117fb.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/crunchy-coronation-chicken-salad",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 400 kcal or less, Chicken, Coronation chicken, Cucumber, Cucumbers, Curry powder, Flaked almond, Flaked almonds, Good Food, Mains, Mango chutney, Quick, Salad, Watercress",
    "cookTime": "PT15M",
    "totalTime": "PT20M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "399 calories",
      "fatContent": "24 grams fat",
      "saturatedFatContent": "3 grams saturated fat",
      "carbohydrateContent": "10 grams carbohydrates",
      "sugarContent": "9 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "37 grams protein",
      "sodiumContent": "0.78 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "2 skinless chicken breasts",
      "1 tsp mild or medium  curry powder",
      "3 tbsp olive oil",
      "2 tbsp mango chutney",
      "1⁄2  lemon",
      "1⁄2  cucumber sliced into sticks",
      "50g bag watercress",
      "2 tbsp toasted  flaked almond"
    ],
    "recipeInstructions": [
      {
        "text": "Toss the chicken breasts with the curry powder and 1 tbsp of the oil. Heat a large non-stick pan and cook the chicken for 5-6 mins on each side until golden and cooked through, then cut into strips."
      },
      {
        "text": "Whisk together the remaining oil and mango chutney with a good squeeze of lemon juice. Then, in a large bowl, toss with the cucumber, watercress, chicken and most of the flaked almonds. Divide between two bowls, scatter with the rest of the almonds, and enjoy with some crusty bread on the side."
      }
    ]
  },
  {
    "name": "Tricolore pizza with basil oil",
    "description": "Colourful, healthy, quick and delicious. A must-try recipe for all cooks. Once perfected swap the toppings about and experiment",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10340_11-6f0d9c1.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/tricolore-pizza-basil-oil",
    "keywords": "Avocado, Avocados, Basil leaf, Basil leaves, Cheese, Good Food, Make ahead, Mozzarella, Pizza, Tomato, Tomatoes",
    "cookTime": "PT15M",
    "totalTime": "PT25M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "359 calories",
      "fatContent": "19 grams fat",
      "saturatedFatContent": "4 grams saturated fat",
      "carbohydrateContent": "35 grams carbohydrates",
      "sugarContent": "4 grams sugar",
      "fiberContent": "4 grams fiber",
      "proteinContent": "14 grams protein",
      "sodiumContent": "1.13 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "175g  from a 500g pack ciabatta bread mix, plus a little extra for dusting",
      "3 tbsp olive oil",
      "large handful basil leaf",
      "1 avocado halved and thinly sliced",
      "splash lemon juice",
      "125g ball reduced-fat  mozzarella",
      "225g mixed tomato sliced and drained on kitchen paper"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to its highest setting, about 240C/fan 220C/gas 9. Tip the bread mix into a large bowl, pour over 125ml lukewarm water and 1 tbsp olive oil, then mix well to a sticky dough. Knead for a few mins, using some of the extra dry mix to stop it sticking. Place in an oiled bowl, cover with a tea towel and leave in a warm place for 15 mins."
      },
      {
        "text": "While the dough is rising, put the remaining oil in a small blender with most of the basil, then whizz until the leaves are finely chopped. Toss the avocado in the lemon juice, then tear the mozzarella into rough pieces. 3 Using a little more of the dry bread mix to help you, roll and stretch the dough out to a rough 25 x 30cm rectangle on a large baking sheet. Brush over the basil oil, scatter with the mozzarella and tomato slices, then bake for 10-12 mins until the base is crisp and the cheese melted. To serve, scatter with the avocado slices and remaining basil leaves, then season with freshly ground"
      }
    ]
  },
  {
    "name": "Golden goat’s cheese tomatoes",
    "description": "There aren't many meals this won't go well with, pasta, couscous, rice, even barbeques, dinner parties and suppers",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10350_10-bb1a635.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/golden-goats-cheese-tomatoes",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 400 kcal or less, Crème fraîche, Goat's Cheese, Good Food, Mains, Prosciutto, Quick, Side dish, Tomato, Tomato dish, Tomatoes",
    "cookTime": "PT15M",
    "totalTime": "PT25M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "249 calories",
      "fatContent": "17 grams fat",
      "saturatedFatContent": "9 grams saturated fat",
      "carbohydrateContent": "10 grams carbohydrates",
      "sugarContent": "9 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "16 grams protein",
      "sodiumContent": "1.6 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Main course, Supper",
    "recipeIngredients": [
      "250g bag spinach",
      "4 slices prosciutto",
      "3 large tomatoes halved",
      "1 heaped tbsp crème fraîche",
      "50g goat's cheese (from a log with rind), chopped"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 200C/fan 180C/gas 6. Put the spinach in a colander, pour over a kettle of boiling water until the spinach wilts, then drain and squeeze out as much liquid as you can (you might need to do this in two batches). Put the spinach in the bottom of a gratin or baking dish, season, then sprinkle with nutmeg."
      },
      {
        "text": "Drape the prosciutto over and around the spinach, then sit the tomato halves on top, cut-side up. Dot the crème fraîche over the whole dish, scatter with the goat’s cheese, then season with more pepper. Bake for 10-15 mins until the cheese is melting into the crème fraîche and the edges are starting to bubble. Scoop out of the dish and serve with crusty bread and a green salad."
      }
    ]
  },
  {
    "name": "Pea, mint & goat’s cheese quiche",
    "description": "Spreading the peas on the base creates two separate layers, which looks attractive and adds an element of surprise when you cut it",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9881_11-5d9e3a6.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/pea-mint-goats-cheese-quiche",
    "keywords": " Josh Eagleton, 600 kcal or less, Al fresco, Barney Desmazery, Cheese, Comfort Food, Comforting, Egg, Eggs, Frozen pea, Frozen peas, Goat's Cheese, Mains, Make ahead, Mint, Over an hour, PASTRY, Peas, Quiche, Summer",
    "cookTime": "PT40M",
    "totalTime": "PT1H20M",
    "recipeYield": "Slices into 8",
    "nutrition": {
      "calories": "576 calories",
      "fatContent": "46 grams fat",
      "saturatedFatContent": "25 grams saturated fat",
      "carbohydrateContent": "32 grams carbohydrates",
      "sugarContent": "3 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "12 grams protein",
      "sodiumContent": "0.83 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Buffet, Dinner, Lunch, Main course, Side dish, Snack, Starter, Supper",
    "recipeIngredients": [
      "300g frozen pea",
      "3 tbsp olive oil",
      "handful mint leaves",
      "2 eggs",
      "284ml pot double cream",
      "4 spring onions finely sliced",
      "200g mild goat's cheese crumbled",
      "280g plain flour plus extra for dusting",
      "140g cold butter cut into pieces"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 200C/fan 180C/gas 6. Follow steps 1 and 2 of the Sticky onion & cheddar quiche recipe, opposite page. 2 While the pastry is chilling, cook the peas in boiling water for 3 mins, then drain and refresh under cold water. Use a hand blender to purée the peas with the olive oil, then stir in the chopped mint and season."
      },
      {
        "text": "Lightly prick the base of the tart with a fork, line the tart case with a large circle of greaseproof paper or foil, then fill with baking beans. Blind-bake the tart for 20 mins, remove the paper and beans, then continue to cook for 5-10 mins until biscuit brown."
      },
      {
        "text": "While the tart is cooking, beat the eggs in a large bowl. Gradually add the cream and stir in the onions. Season. When the case is ready, spoon and spread the peas over the base, pour over the egg mix, then finally scatter over the goat’s cheese. Bake for 20-25 mins until set and golden brown. Leave to cool in the case, trim the edges of the pastry, then remove and serve in slices."
      }
    ]
  },
  {
    "name": "Feta tabbouleh with aubergines",
    "description": "This healthy, high fibre dish proves that feta and grilled vegetables are a perfect match",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9892_11-99f4f25.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/feta-tabbouleh-aubergines",
    "keywords": "Al fresco, Aubergine, Aubergines, Cherry tomato, Cherry tomatoes, Chickpea, Chickpeas, Egg plant, Feta, Feta cheese, Good Food, Salad, Summery",
    "prepTime": "PT10M",
    "cookTime": "PT20M",
    "totalTime": "PT30M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "395 calories",
      "fatContent": "19 grams fat",
      "saturatedFatContent": "5 grams saturated fat",
      "carbohydrateContent": "44 grams carbohydrates",
      "sugarContent": "7 grams sugar",
      "fiberContent": "6 grams fiber",
      "proteinContent": "14 grams protein",
      "sodiumContent": "1.29 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Main course, Side dish, Snack, Supper",
    "recipeIngredients": [
      "140g bulgur wheat",
      "2 garlic cloves crushed",
      "4 tbsp olive oil",
      "2 aubergines thinly sliced lengthways",
      "410g can chickpea drained",
      "140g cherry tomato halved",
      "1 red onion chopped",
      "100g feta cheese crumbled",
      "1 large bunch mint leaves chopped",
      "juice 1½ lemon"
    ],
    "recipeInstructions": [
      {
        "text": "Cook the bulgur wheat according to pack instructions, then drain well. In a small bowl, mix together the garlic and olive oil, then use half to brush over both sides of the aubergine strips with some seasoning. Sear the strips on a hot griddle or in a frying pan for 3 mins each side until charred and softened."
      },
      {
        "text": "Tip the bulgur wheat into a large bowl with the chickpeas, tomatoes, onion, feta and mint, then pour over the remaining garlicky oil and the lemon juice. Mix and season well, then pile onto plates with the charred aubergines."
      }
    ]
  },
  {
    "name": "Prawn cocktail salad",
    "description": "Try this main meal twist on a seventies classic",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9987_12-b5a0094.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/prawn-cocktail-salad",
    "keywords": " Josh Eagleton, 10-30 minutes, 400 kcal or less, Avocado, Avocados, BBC Good Food magazine, Cherry tomato, Cherry tomatoes, Cocktail, Good Food, Mains, No-cook, Prawns, Quick, Romaine lettuce, Romaine lettuces, Salad, Seafood, Shellfish, Spring onion, Spring onions, Under 10 minutes",
    "prepTime": "PT10M",
    "totalTime": "PT10M",
    "recipeYield": "Serves 4",
    "nutrition": {
      "calories": "297 calories",
      "fatContent": "25 grams fat",
      "saturatedFatContent": "3 grams saturated fat",
      "carbohydrateContent": "6 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "14 grams protein",
      "sodiumContent": "1.3 milligram of sodium"
    },
    "recipeCategory": "Dinner, Lunch, Main course, Starter, Supper",
    "recipeIngredients": [
      "200g  bag large cooked  prawns",
      "1 large ripe avocado halved, peeled and sliced",
      "200g  punnet  cherry tomato halved",
      "4  spring onions finely sliced",
      "1  romaine lettuce shredded",
      "2 tbsp olive oil",
      "juice ½  lemon",
      "3 tbsp mayonnaise",
      "2 tbsp ketchup",
      "juice ½  lemon"
    ],
    "recipeInstructions": [
      {
        "text": "Whisk the ingredients for the dressing together. If it’s a little thick, add a splash of water."
      },
      {
        "text": "Put the prawns, avocado, tomatoes, spring onions and lettuce in a large salad bowl, drizzle with the olive oil and lemon juice, toss gently, then serve with the dressing handed round separately."
      }
    ]
  },
  {
    "name": "Sticky sausage burgers with blue cheese",
    "description": "A great burger that kids and adults alike will love",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9990_12-aeb8094.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/sticky-sausage-burgers-blue-cheese",
    "keywords": " Josh Eagleton, 30-60 minutes, 600 kcal or less, Barbecue, BBC Good Food magazine, BBQ, Burgers, Chutney, Chutneys, Good Food, Junk, Mains, Sausages, Takeaway",
    "prepTime": "PT10M",
    "cookTime": "PT25M",
    "totalTime": "PT35M",
    "recipeYield": "Serves 4",
    "nutrition": {
      "calories": "436 calories",
      "fatContent": "30 grams fat",
      "saturatedFatContent": "11 grams saturated fat",
      "carbohydrateContent": "27 grams carbohydrates",
      "sugarContent": "9 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "16 grams protein",
      "sodiumContent": "2.71 milligram of sodium"
    },
    "recipeCategory": "Dinner, Lunch, Main course, Supper",
    "recipeIngredients": [
      "6 pork  sausages",
      "50g breadcrumbs",
      "4 tbsp caramelised onion  chutney",
      "10  sage leaves, chopped",
      "50g blue cheese (we used Gorgonzola) , cut into 4 chunks",
      "4 burger buns and  salad to serve"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 200C/fan 180C/gas 6. Using scissors, snip open the sausage skins and squeeze the meat into a bowl. Add the breadcrumbs, 2 tbsp chutney and the sage, then mix well with your hands. Divide the mix into 4, then shape into burgers, pushing the chunks of cheese into the middle of each patty. Make sure the cheese is completely sealed in or it will leak out during cooking."
      },
      {
        "text": "Place the burgers on a baking tray, then cook for 25 mins until browned and cooked through to the middle. Split open the buns, stuff with your favourite salad, then top with a burger and some of the remaining chutney."
      }
    ]
  },
  {
    "name": "Praline meringue cake with strawberries",
    "description": "A caramel-flavoured praline meringue that's perfect for a summer's day",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10006_11-77b2b87.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/praline-meringue-cake-strawberries",
    "keywords": "Al fresco, Almond, Almonds, Cornflour, Dessert, Egg white, Egg whites, Indulgent, Make ahead, Mereng, Meringue, Pavlova, Pud, Sara Buenfeld, Strawberries, Strawberry, Summer",
    "cookTime": "PT1H",
    "totalTime": "PT2H30M",
    "recipeYield": 12,
    "nutrition": {
      "calories": "533 calories",
      "fatContent": "35 grams fat",
      "saturatedFatContent": "35 grams saturated fat",
      "carbohydrateContent": "51 grams carbohydrates",
      "sugarContent": "50 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "7 grams protein",
      "sodiumContent": "0.16 milligram of sodium"
    },
    "recipeCategory": "Dessert, Dinner",
    "recipeIngredients": [
      "175g whole  almond toasted",
      "225g golden caster sugar",
      "225g light muscovado sugar",
      "6 egg whites",
      "1 tbsp cornflour",
      "2 tsp white wine vinegar",
      "1kg strawberry hulled and halved, or quartered if large",
      "586ml icing sugar plus extra for decorating",
      "586g pot double cream"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 140C/fan 120C/gas 1, and line two flat baking sheets with baking parchment. Whizz about two-thirds of the toasted almonds in a food processor until chopped. Don’t let them start to look greasy or clump together – they should still be in pieces rather than ground. Roughly chop the remaining third with a knife."
      },
      {
        "text": "Stir the sugars together. Using an electric hand whisk, beat the egg whites in a large bowl until stiff, then add the sugar in three batches, beating the mixture back to stiff after each addition. Add the cornflour and vinegar, and keep going until the meringue mixture is glossy and so stiff that the beaters begin to feel heavy when stirring – this can take up to 5 mins."
      },
      {
        "text": "Quickly fold in all of the finely chopped nuts and most of the roughly chopped with a spatula, then divide the mixture between the two baking sheets. Spread both into 20cm circles, then scatter the remaining chopped nuts over. Bake for 1 hr, then turn the oven off and leave the meringues inside to cool for at least 1 hr. Leave the oven door closed (this will help to prevent them cracking). Will keep overnight in an airtight container, or freeze, wrapped in cling film, for up to 1 month."
      },
      {
        "text": "For the strawberry sauce, purée 600g of the strawberries in a food processor or blender. Press through a sieve to remove the seeds, then sweeten with 2 tbsp of the icing sugar. Can be made up to 1 day ahead. Sieve the remaining icing sugar into the double cream, whip until it just holds its shape, then carefully swirl through two-thirds of the sauce."
      },
      {
        "text": "To serve, slide one of the meringues off its baking parchment onto a serving plate, then spread over half the cream. Place the second meringue on top, pile over the rest of the cream and top with the remaining strawberries. Dust with a little more icing sugar if you like, and serve the leftover strawberry sauce alongside."
      }
    ]
  },
  {
    "name": "Cod Provençal",
    "description": "Gordon cooks a one-pan dish for two that has all the flavours of the sun-drenched south of France",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10011_10-b703d1c.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/cod-provencal",
    "keywords": " Josh Eagleton, 2 servings, 30-60 minutes, 800 kcal or less, Anchovies, Anchovy, Caper, Capers, Cherry tomato, Cherry tomatoes, Cod, Fennel bulb, Fennel bulbs, Fish, Gordon ramsay, Mains, Red pepper, Red peppers, Spanish, White fish",
    "cookTime": "PT25M",
    "totalTime": "PT55M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "633 calories",
      "fatContent": "42 grams fat",
      "saturatedFatContent": "6 grams saturated fat",
      "carbohydrateContent": "21 grams carbohydrates",
      "sugarContent": "19 grams sugar",
      "fiberContent": "8 grams fiber",
      "proteinContent": "45 grams protein",
      "sodiumContent": "5.33 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course",
    "recipeIngredients": [
      "2 cod fillets, skin on, each weighing about 175g, see box, far right",
      "1 tsp coarse salt flakes",
      "2 red peppers",
      "1 garlic clove",
      "1 lemon",
      "2 fennel bulbs",
      "6 tbsp olive oil",
      "350g very ripe cherry tomato halved",
      "1 tbsp balsamic vinegar",
      "handful pitted black olives",
      "1 tbsp caper in brine, drained",
      "small handful each lemon thyme,  oregano and basil leaves, with a few smal basil leaves kept aside",
      "20 marinated anchovy fillets, roughly chopped"
    ],
    "recipeInstructions": [
      {
        "text": "Neatly trim the cod fillets. Score the skin of each fillet 3-4 times at regular intervals. Lay the fish in a shallow dish and sprinkle both sides of the fillets with the salt and some freshly ground black pepper. Set aside or chill overnight, see box, far right."
      },
      {
        "text": "Deseed and finely slice the peppers, then finely grate the garlic and lemon zest over the peppers. Carefully slice the fennel on a mandolin, or as finely as possible with a sharp knife, then tip half the fennel into a bowl of iced water and set aside."
      },
      {
        "text": "Brush the salt off the fish or, if it has dissolved, wipe the brine off with kitchen paper. Heat 2 tbsp of olive oil in a large non-stick pan, cook the fish, skin side down, for 4 mins until the skin is crisp and browned, then remove from the pan."
      },
      {
        "text": "Put 1 tbsp more oil into the pan. Fry the fennel and the marinated peppers together for 4-5 mins until soft and starting to brown. Throw in the tomatoes and the balsamic vinegar, then continue to cook for 2-3 mins until they soften and release their juices. Scatter over the olives, capers and herbs, then toss everything together."
      },
      {
        "text": "Nestle the fish fillets, skin side up, among the vegetables, then lower the heat and simmer, uncovered, for 5-6 mins until the fish is just cooked through. Lift the fish from the pan and give the sauce a final simmer and stir, then turn off the heat. This dish is better served warm rather than hot, so don’t worry about the vegetables or fish resting before you serve."
      },
      {
        "text": "Drain the reserved fennel and pat dry with kitchen paper. Toss with the juice from half the grated lemon, 2 tbsp olive oil and the anchovies. To serve, spoon the vegetables into the middle of two large dinner plates. Sit the cod, skin side up, on top of the vegetables and top with a neat bundle of fennel salad. Drizzle everything with a touch more oil, then scatter with the small basil leaves."
      }
    ]
  },
  {
    "name": "Strawberry shortcake",
    "description": "Encapsulate British summertime with these cute little shortcakes, perfect piled high with clotted cream and jam",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-10028_12-fa74ea2.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/strawberry-vanilla-shortcakes",
    "keywords": "Afternoon tea, Cakes, Clotted cream, Dessert, Jam, Jane Hornby, Make ahead, Pud, Pudding, Scones, Summer, Vanilla pod, Vanilla pods",
    "cookTime": "PT12M",
    "totalTime": "PT27M",
    "recipeYield": "Make 8",
    "nutrition": {
      "calories": "502 calories",
      "fatContent": "30 grams fat",
      "saturatedFatContent": "18 grams saturated fat",
      "carbohydrateContent": "55 grams carbohydrates",
      "sugarContent": "22 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "6 grams protein",
      "sodiumContent": "0.82 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Dessert, Treat",
    "recipeIngredients": [
      "350g self-raising flour plus extra for dusting",
      "100g butter cold, cubed",
      "100g caster sugar",
      "1 vanilla pod seeds scraped",
      "100ml milk warmed",
      "1 egg plus a little extra beaten egg for glazing",
      "squeeze lemon juice",
      "1 tbsp icing sugar",
      "227g tub clotted cream",
      "250g strawberry tickly sliced",
      "strawberry jam (see 'goes well with' for recipe, or buy ready-made)"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 220C/fan 200C/gas 7 and lightly flour a baking sheet. Put the flour, butter, sugar, half of the vanilla seeds and ¼ tsp salt into the bowl of a food processor, then pulse until fine. Tip into a large bowl. Beat the milk, egg and a good squeeze of lemon together, then tip into the bowl and bring together with a knife, using a cutting action, until you have a clumpy dough. Finally bring together with your hands if you need to."
      },
      {
        "text": "Lightly flour the work surface, tip the dough onto it, then quickly shape into a smooth-ish disc. Using a rolling pin, pat out to 2cm thick. Cut out 8 rounds with a smooth 7cm cutter (you’ll need to pinch together the trimmings). Glaze just the tops with beaten egg, transfer to the floured sheet, then bake for 10-12 mins until risen and golden, and they sound hollow when tapped on the bottom. Cool on a wire rack."
      },
      {
        "text": "Beat the remaining vanilla seeds and icing sugar into the clotted cream. It will get runnier at first, but keep beating and it will thicken again. To serve, slice the very top from each shortcake to give a flat surface, then spoon over about 1 tsp jam. Top with a good dollop of the vanilla clotted cream and finish with the strawberries."
      }
    ]
  },
  {
    "name": "Fastest ever lemon pudding",
    "description": "Being short of time needn't stop you making your own pudding. This microwave-friendly sponge is ready in 10 minutes and can easily be a chocolate pud too",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2008/05/microwave-lemon-sponge-pudding-d9e8e37.jpg?resize=768,698",
        "width": 768,
        "height": 698
      },
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2008/05/microwave-lemon-sponge-pudding-d9e8e37.jpg?resize=1366,1242",
        "width": 1366,
        "height": 1242
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/fastest-ever-lemon-pudding",
    "keywords": "Beginners, Chocoalte pudding, Crème fraîche, Good Food, Lemon, Lemons, Microwave, Pudd, Pudding, Quick, Sponge",
    "cookTime": "PT4M",
    "totalTime": "PT10M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "457 calories",
      "fatContent": "25 grams fat",
      "saturatedFatContent": "14 grams saturated fat",
      "carbohydrateContent": "55 grams carbohydrates",
      "sugarContent": "34 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "6 grams protein",
      "sodiumContent": "0.75 milligram of sodium"
    },
    "recipeCategory": "Dessert, Supper",
    "recipeIngredients": [
      "100g caster sugar",
      "100g softened butter",
      "100g self-raising flour",
      "2 eggs",
      "zest of 1  lemon",
      "1 tsp vanilla essence",
      "4 tbsp lemon curd",
      "crème fraîche or ice cream, to serve"
    ],
    "recipeInstructions": [
      {
        "text": "Mix the sugar, butter, flour, eggs, lemon zest and vanilla together until creamy, then spoon into a medium microwave-proof baking dish. Microwave on High for 3 mins, turning halfway through cooking, until risen and set all the way through. Leave to stand for 1 min."
      },
      {
        "text": "Meanwhile, heat the lemon curd for 30 secs in the microwave and stir until smooth. Pour all over the top of the pudding and serve with a dollop of crème fraîche or scoops of ice cream."
      }
    ]
  },
  {
    "name": "Creamy pea & chive risotto",
    "description": "Pearl barley is rich in calcium, minerals, iron and potassium, and that's just to start with. Make the most of it with this creamy risotto",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9846_11-8ba3a05.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/creamy-pea-chive-risotto",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 30-60 minutes, 800 kcal or less, Cream cheese, Good Food, Healthy, Mains, Pearl barley, Quick, Rice, Risotto",
    "cookTime": "PT25M",
    "totalTime": "PT30M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "656 calories",
      "fatContent": "20 grams fat",
      "saturatedFatContent": "6 grams saturated fat",
      "carbohydrateContent": "104 grams carbohydrates",
      "sugarContent": "12 grams sugar",
      "fiberContent": "8 grams fiber",
      "proteinContent": "20 grams protein",
      "sodiumContent": "1.41 milligram of sodium"
    },
    "recipeCategory": "Main course, Starter, Supper",
    "recipeIngredients": [
      "2 tbsp olive oil",
      "1 onion finely chopped",
      "200g pearl barley",
      "1.2l vegetable stock",
      "140g pea",
      "100g light cream cheese with chives",
      "small bunch chives snipped"
    ],
    "recipeInstructions": [
      {
        "text": "Heat the oil in a large, deep pan, then gently fry the onion for 3-4 mins. Stir in the pearl barley, sizzle for a few mins, then pour in about a third of the stock. Simmer fiercely for 20 mins, stirring occasionally, adding more stock gradually as it is absorbed. With 5 mins to go, stir in the peas. After 20 mins there should be some liquid left and the barley should be cooked through."
      },
      {
        "text": "Turn the heat off under the risotto and let it sit for a min, then stir in the cream cheese and most of the chives. Season well and serve scattered with the rest of the chives."
      }
    ]
  },
  {
    "name": "Squid, chickpea & chorizo salad",
    "description": "Found in every ocean, squid is the most widely available seafood in the world and one of the cheapest. This works well on the barbecue, too",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9851_11-6814d0b.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/squid-chickpea-chorizo-salad",
    "keywords": " Josh Eagleton, Australian, Barney, Barney Desmazery, BBQ, Chickpea, Chickpeas, Chorizo, Fish, Main salad, Octopus, Red chilli, Red chillies, Red pepper, Red peppers, Salad, Seafood, Spanish, Squid",
    "cookTime": "PT20M",
    "totalTime": "PT1H",
    "recipeYield": 8,
    "nutrition": {
      "calories": "443 calories",
      "fatContent": "27 grams fat",
      "saturatedFatContent": "5 grams saturated fat",
      "carbohydrateContent": "22 grams carbohydrates",
      "sugarContent": "8 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "29 grams protein",
      "sodiumContent": "1.23 milligram of sodium"
    },
    "recipeCategory": "Buffet, Side dish, Starter",
    "recipeIngredients": [
      "4 red peppers",
      "2 x 400g cans chickpea rinsed and drained",
      "huge bunch parsley roughly chopped",
      "1 red chilli deseeded and chopped",
      "2 garlic cloves finely chopped",
      "100ml olive oil",
      "600g cleaned squid sliced into rings, tentacles kept whole",
      "200g cooking  chorizo cut into chickpea-size chunks",
      "juice and zest 1 large lemon"
    ],
    "recipeInstructions": [
      {
        "text": "Cook the peppers whole under a grill, on a barbecue or griddle, until completely charred. Place the peppers in a bowl, cover with a plate until cool enough to handle, then peel, deseed and finely slice. In a large bowl mix the peppers and any juices with the chickpeas, parsley, chilli and garlic. Set aside."
      },
      {
        "text": "Heat a large frying pan until smoking. Working quickly and carefully, add a splash of oil to the pan, then the squid. Stir-fry for about 30 secs. Scatter the chorizo over the squid, continue to cook for 30 secs more, then tip into the bowl with the peppers. Season everything with salt and pepper, then dress with the remaining oil, lemon juice and lemon zest. Mix together, pile onto a platter and let everyone help themselves."
      }
    ]
  },
  {
    "name": "French bean & duck Thai curry",
    "description": "Traditionally, this is made with Asian snake beans, which taste very similar to French beans – but are about a foot long",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9854_12-7ff180e.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/french-bean-duck-thai-curry",
    "keywords": " Josh Eagleton, 4 servings, 800 kcal or less, Asian, Barney Desmazery, Bean sprout, Bean sprouts, Coconut milk, Curry, Duck, Fish sauce, French bean, French beans, Green beans, Green curry, Lime, Limes, Mains, Over an hour, Red chilli, Red chillies, Thai, Thai curry paste",
    "cookTime": "PT1H45M",
    "totalTime": "PT2H5M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "638 calories",
      "fatContent": "57 grams fat",
      "saturatedFatContent": "26 grams saturated fat",
      "carbohydrateContent": "11 grams carbohydrates",
      "sugarContent": "9 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "28 grams protein",
      "sodiumContent": "2.32 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course",
    "recipeIngredients": [
      "3-4  duck breasts about 700g/1lb 9oz in total",
      "6 tbsp  green Thai curry paste",
      "1 tbsp light brown sugar",
      "400ml can coconut milk",
      "2 tbsp fish sauce",
      "juice 2 limes",
      "6 lime leaves 3 left whole and 3 finely shredded",
      "200g French bean trimmed",
      "2 handfuls beansprouts",
      "handful coriander leaves",
      "1 red chilli deseeded and sliced (optional)"
    ],
    "recipeInstructions": [
      {
        "text": "Place a sauté pan over a low heat and add the duck breasts, skin-side down, to the dry pan. Slowly fry until the skin is brown and a lot of the fat has rendered off – this can take about 20 mins. Flip them over to seal the other side for 1 min, then remove to a board until cool enough to handle. Pour all but 2 tbsp of the fat from the pan."
      },
      {
        "text": "While the meat is resting, return the pan to the heat, then fry the curry paste and sugar for 1-2 mins until it becomes fragrant. Tip in the coconut milk, then fill the can with water and add this, too. Add the fish sauce, half the lime juice and the whole lime leaves, then bring to a simmer. Slice the duck breasts, then tip into the curry. Cover the pan, then simmer everything on the lowest heat for 1 hr until the duck is tender. Add the beans to the curry, then continue to cook, covered, for 10 mins until the beans are tender with a slight crunch. Taste and add more lime juice, fish sauce or sugar to season."
      },
      {
        "text": "Stir in the bean sprouts, cook for 1 min more, then serve with coriander, shredded lime leaves and sliced chilli, if you like, and boiled jasmine rice."
      }
    ]
  },
  {
    "name": "Broad bean bruschetta",
    "description": "Perfect for a rustic lunch or snack, this posh beans on toast is perfect to impress guests",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9867_10-a7d75fe.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/broad-bean-bruschetta",
    "keywords": " Josh Eagleton, 30-60 minutes, 4 servings, 600 kcal or less, Barney Desmazery, Broad beans; rustic, Mains, Make ahead, Pecorino, Sourdough bread, Toasts, White bread",
    "cookTime": "PT10M",
    "totalTime": "PT40M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "429 calories",
      "fatContent": "26 grams fat",
      "saturatedFatContent": "9 grams saturated fat",
      "carbohydrateContent": "32 grams carbohydrates",
      "sugarContent": "2 grams sugar",
      "fiberContent": "7 grams fiber",
      "proteinContent": "20 grams protein",
      "sodiumContent": "1.18 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Side dish, Snack, Starter, Supper",
    "recipeIngredients": [
      "300g podded broad bean",
      "4 tbsp olive oil plus extra for drizzling",
      "juice 1  lemon",
      "handful mint leaves",
      "4 slices rustic white bread such as sourdough",
      "1 garlic clove peeled but left whole",
      "140g pecorino cheese, shaved with a peeler"
    ],
    "recipeInstructions": [
      {
        "text": "Cook the broad beans in boiling water for 2 mins. Drain, refresh under cold water, drain again, then peel from their skins."
      },
      {
        "text": "Use a masher to roughly crush the beans with the olive oil and lemon juice, then stir through the mint. Season with salt and pepper to taste."
      },
      {
        "text": "Heat a griddle pan, toast the bread on both sides, then rub with the garlic clove. Spoon some of the beans over each slice of bread, scatter over the pecorino and drizzle with more olive oil to serve."
      }
    ]
  },
  {
    "name": "Sticky onion & cheddar quiche",
    "description": "A crisp pastry case and a just-set creamy filling, quiche is a good solution to any meal dilemma from dinner parties, suppers, picnics and even afternoon tea",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9872_11-4b49408.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/sticky-onion-cheddar-quiche",
    "keywords": " Josh Eagleton, Al fresco, Barney Desmazery, Cheese, Double cream, Egg, Eggs, Make ahead, Mature cheddar, PASTRY, Pastry case, Quiche, Summer, Tart",
    "cookTime": "PT40M",
    "totalTime": "PT1H20M",
    "recipeYield": "Slices into 8",
    "nutrition": {
      "calories": "567 calories",
      "fatContent": "44 grams fat",
      "saturatedFatContent": "26 grams saturated fat",
      "carbohydrateContent": "33 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "11 grams protein",
      "sodiumContent": "0.72 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Buffet, Dinner, Lunch, Main course, Snack, Starter, Supper",
    "recipeIngredients": [
      "25g butter",
      "500g small onion (about 5 in total), halved and finely sliced",
      "2 eggs",
      "284ml pot double cream",
      "140g mature cheddar coarsely grated",
      "280g plain flour plus extra for dusting",
      "140g cold butter"
    ],
    "recipeInstructions": [
      {
        "text": "To make the pastry, tip the flour and butter into a bowl, then rub together with your fingertips until completely mixed and crumbly. Add 8 tbsp cold water, then bring everything together with your hands until just combined. Roll into a ball and use straight away or chill for up to 2 days. The pastry can also be frozen for up to a month."
      },
      {
        "text": "Roll out the pastry on a lightly floured surface to a round about 5cm larger than a 25cm tin. Use your rolling pin to lift it up, then drape over the tart case so there is an overhang of pastry on the sides. Using a small ball of pastry scraps, push the pastry into the corners of the tin. Chill in the fridge or freezer for 20 mins."
      },
      {
        "text": "Heat oven to 200C/fan 180C/gas 6. While the pastry is chilling, heat the butter in a pan and cook the onions for 20 mins, stirring occasionally, until they become sticky and golden. Remove from the heat."
      },
      {
        "text": "Lightly prick the base of the tart with a fork, line the tart case with a large circle of greaseproof paper or foil, then fill with baking beans. Blind-bake the tart for 20 mins, remove the paper and beans, then continue to cook for 5-10 mins until biscuit brown."
      },
      {
        "text": "Meanwhile, beat the eggs in a bowl, then gradually add the cream. Stir in the onions and half the cheese, then season with salt and pepper. Carefully tip the filling into the case, sprinkle with the rest of the cheese, then bake for 20-25 mins until set and golden. Leave to cool in the case, trim the edges of the pastry, then remove and serve in slices."
      }
    ]
  },
  {
    "name": "Courgette, mushroom & mozzarella tart",
    "description": "A quick summer tart that's ideal for a buffet or midweek meal",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9983_12-30b31c4.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/courgette-mushroom-mozzarella-tart",
    "keywords": " Josh Eagleton, 10-30 minutes, 600 kcal or less, BBC Good Food magazine, Courgette, Courgettes, Good Food, Mains, Mozzarella, Mushroom, Mushrooms, Puff pastry, Quick, Summer, Supper, Tart, Zucchini",
    "prepTime": "PT8M",
    "cookTime": "PT20M",
    "totalTime": "PT28M",
    "recipeYield": "Serves 4",
    "nutrition": {
      "calories": "491 calories",
      "fatContent": "34 grams fat",
      "saturatedFatContent": "13 grams saturated fat",
      "carbohydrateContent": "36 grams carbohydrates",
      "sugarContent": "2 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "13 grams protein",
      "sodiumContent": "1.14 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Buffet, Lunch, Main course, Snack, Starter, Supper",
    "recipeIngredients": [
      "2 tbsp  sundried  tomato paste",
      "1  garlic clove crushed",
      "375g  ready-rolled  puff pastry sheet",
      "125g  ball  mozzarella cut into chunks",
      "100g mushroom sliced",
      "1  courgette thinly sliced",
      "1 tbsp olive oil",
      "2 tsp  dried  oregano"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 220C/fan 200C/gas 7. Mix the tomato paste and garlic together. Place the pastry on a baking sheet and score a border about 1cm in from the edge. Prick the pastry within the border all over with a fork, then spread with the tomato mixture."
      },
      {
        "text": "Top with the cheese, mushrooms and courgette, drizzle with olive oil, then evenly scatter over the oregano along with a little salt and pepper. Bake for 20 mins until risen and golden, then slice and serve with salad"
      }
    ]
  },
  {
    "name": "Smoky fishcakes with oat crumb",
    "description": "Give your fish cakes an extra crunch with this oaty recipe",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9896_12-a100271.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/smoky-fishcakes-oat-crumb",
    "keywords": " Josh Eagleton, 2 servings, 30-60 minutes, 800 kcal or less, Fish cake, Fishcakes, Good Food, Haddock, Mains, Make ahead, Oats, Patties, Patty, Smoked haddock, Spring onion, Spring onions, Tartar",
    "cookTime": "PT35M",
    "totalTime": "PT40M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "600 calories",
      "fatContent": "25 grams fat",
      "saturatedFatContent": "3 grams saturated fat",
      "carbohydrateContent": "68 grams carbohydrates",
      "sugarContent": "6 grams sugar",
      "fiberContent": "7 grams fiber",
      "proteinContent": "31 grams protein",
      "sodiumContent": "2.41 milligram of sodium"
    },
    "recipeCategory": "Dinner, Lunch, Main course, Supper",
    "recipeIngredients": [
      "400g potato peeled and cut into large chunks",
      "175g undyed smoked haddock",
      "2 spring onions finely chopped",
      "4 tbsp tartar sauce",
      "85g whole oats",
      "1 egg beaten",
      "2 tbsp sunflower oil"
    ],
    "recipeInstructions": [
      {
        "text": "Boil potatoes in salted water for 15 mins until tender, drain, then return to the pan. Mash quickly over a gentle heat until the potatoes become quite dry, then transfer to a large bowl. Put the fish in a microwave-proof dish with a couple of spoonfuls of water, cover with cling film, then cook on Medium for 2-3 mins until the fish flakes easily. Gently peel away the skin, then flake into the potatoes in large chunks."
      },
      {
        "text": "Mix in the spring onions, 2 tbsp of tartare sauce and some seasoning, then shape into 4 cakes. Briefly whizz the oats in a food processor until slightly crumbly-looking, then tip onto a plate. Dip the fish cakes into the egg, then into the oats to coat. Chill for 20 mins to firm up."
      },
      {
        "text": "Heat the oil in a large, non-stick frying pan, then fry the cakes for 5 mins on each side until golden and hot. Serve with the leftover tartare and a green salad."
      }
    ]
  },
  {
    "name": "Pineapple upside-down cake"
  },
  {
    "name": "Marble cake",
    "description": "Bake our easy marble cake with chocolate and vanilla flavours"
  },
  {
    "name": "Aubergine with yogurt & tomato sauces",
    "description": "Aubergine provides a meaty kick to this veggie main, and the versatile sauce will become a favourite for many a dinner",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-7880_11-c38948a.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/aubergine-yogurt-tomato-sauces",
    "keywords": " Josh Eagleton, 10-30 minutes, 30-60 minutes, 400 kcal or less, Cherry tomato, Cherry tomatoes, Chilli flakes, Egg plant, Good Food, Mains, Natural yogurt, Quick, Tomato sauce, Veggie",
    "cookTime": "PT20M",
    "totalTime": "PT30M",
    "nutrition": {
      "calories": "230 calories",
      "fatContent": "14 grams fat",
      "saturatedFatContent": "6 grams saturated fat",
      "carbohydrateContent": "22 grams carbohydrates",
      "sugarContent": "21 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "6 grams protein",
      "sodiumContent": "2.13 milligram of sodium"
    },
    "recipeCategory": "Buffet, Lunch, Main course, Side dish, Snack, Supper, Vegetable",
    "recipeIngredients": [
      "1 large fat aubergine",
      "3 tbsp olive oil",
      "140g cherry tomato halved",
      "1 garlic clove crushed",
      "pinch chilli flakes",
      "125ml tub low-fat natural yogurt",
      "1 tbsp chopped  mint"
    ],
    "recipeInstructions": [
      {
        "text": "Trim the aubergine and cut lengthways into 6 thick slices. Season all over and brush with 2 tbsp of the oil. Heat the remaining oil in a small pan and add the tomatoes, garlic and chilli flakes, along with a little salt. Cook gently for 3-4 mins until the tomatoes are just softened. In a small bowl, mix the yogurt with the mint and some seasoning."
      },
      {
        "text": "Heat a barbecue, griddle pan or grill, then cook the aubergine slices for 5-6 mins each side until nicely browned and softened. Serve 3 slices per person with the minty yogurt and tomato sauces."
      }
    ]
  },
  {
    "name": "Salmon, fennel & orange salad",
    "description": "A great buffet salad to dig in to. Try and make sure your salmon is from a sustainable source",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9432_12-855ed80.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/salmon-fennel-orange-salad",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 400 kcal or less, Chickpea, Chickpeas, Dill, Fennel, Good Food, Mains, Natural yogurt, Orange, Oranges, Quick, Red onion, Red onions, Salad, Salmon, Summer, Summery, Watercress",
    "cookTime": "PT5M",
    "totalTime": "PT15M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "369 calories",
      "fatContent": "16 grams fat",
      "saturatedFatContent": "3 grams saturated fat",
      "carbohydrateContent": "24 grams carbohydrates",
      "sugarContent": "14 grams sugar",
      "fiberContent": "6 grams fiber",
      "proteinContent": "34 grams protein",
      "sodiumContent": "0.59 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Main course, Side dish, Supper",
    "recipeIngredients": [
      "4 salmon",
      "100g bag watercress",
      "410g can chickpea rinsed and drained",
      "1 fennel bulb, thinly sliced",
      "½  red onion thinly sliced",
      "2 oranges",
      "100ml natural yogurt",
      "2 tbsp chopped dill"
    ],
    "recipeInstructions": [
      {
        "text": "Put the salmon in a microwave-proof dish, cover with cling film, then cook on High for 3½-4 mins until the salmon is just cooked. Peel the skin away and flake into large chunks."
      },
      {
        "text": "Toss together the watercress, chickpeas, fennel and onion, then arrange on a large platter. Zest one of the oranges, cut away the skin and pith from both fruit, then segment them both. Squeeze the juice from the middles of the oranges into a bowl and mix 2 tbsp of it with the yogurt, dill, zest and seasoning."
      },
      {
        "text": "Scatter salmon over the salad, then serve drizzled with the creamy orange dressing."
      }
    ]
  },
  {
    "name": "Roast pepper & salmon platter",
    "description": "The perfect alfresco salad. Warm new potatoes, roasted peppers and salmon, mixed with the punchy flavours of capers and anchovies",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9833_11-5ba7dff.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/roast-pepper-salmon-platter",
    "keywords": " Josh Eagleton, 30-60 minutes, 4 servings, 600 kcal or less, Al freso, Anchovies, Anchovy, Basil, Caper, Capers, Mains, New potato, New potatoes, Peppers, Pine nut, Pine nuts, Platter, Red pepper, Red peppers, Rocket, Salad, Salmon, Salmon fillet, Salmon fillets, Sara Buenfeld, Summer",
    "cookTime": "PT25M",
    "totalTime": "PT40M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "575 calories",
      "fatContent": "33 grams fat",
      "saturatedFatContent": "5 grams saturated fat",
      "carbohydrateContent": "35 grams carbohydrates",
      "sugarContent": "15 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "37 grams protein",
      "sodiumContent": "2.7 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Main course, Starter, Supper",
    "recipeIngredients": [
      "5 large  red peppers halved and seeded",
      "3 tbsp extra-virgin olive oil plus extra for the peppers",
      "4 salmon fillets skin on",
      "3 tbsp pine nut",
      "500g pack small new potato",
      "1 tbsp balsamic vinegar",
      "85g marinated anchovy",
      "2 tbsp caper rinsed",
      "20g pack basil torn or shredded",
      "2 handfuls rocket"
    ],
    "recipeInstructions": [
      {
        "text": "1 Heat oven to 220C/200C fan/gas 7. Rub the peppers with a little oil, then place, skin side up, in a large roasting tin. Roast for 15 mins, then add the salmon to the tin, skin side down. Scatter over the pine nuts and return to the oven for 10 mins more."
      },
      {
        "text": "Meanwhile, boil the potatoes in their skins for 8-10 mins until tender, then thickly slice or halve. Mix the oil and vinegar in a large bowl and add the anchovies and capers. When the peppers are cool enough to handle, strip off the skins and very thickly slice the flesh. Toss into the oil mixture with the basil and potatoes, adding any juice from the peppers, then pile onto a large platter with the rocket. Flake the salmon on top in chunky pieces and scatter with the pine nuts. Serve with crusty bread to mop up the juices."
      }
    ]
  },
  {
    "name": "Hot-smoked salmon & egg Caesar",
    "description": "A variation on a Caesar salad, this is on the table in a flash so you can make the most of your free time",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9692_12-9c55ad1.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/hot-smoked-salmon-egg-caesar",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 600 kcal or less, Beginners, Caesar, Caper, Capers, Croûton, Croutons, Egg, Eggs, Good Food, Hot-smoked salmon, Little Gem lettuce, Little Gem lettuces, Mains, Quick, Salad, Salmon, Under 10 minutes",
    "cookTime": "PT5M",
    "totalTime": "PT10M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "434 calories",
      "fatContent": "29 grams fat",
      "saturatedFatContent": "5 grams saturated fat",
      "carbohydrateContent": "19 grams carbohydrates",
      "sugarContent": "3 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "29 grams protein",
      "sodiumContent": "3.29 milligram of sodium"
    },
    "recipeCategory": "Dinner, Lunch, Main course, Snack, Supper",
    "recipeIngredients": [
      "2 eggs",
      "2 Little Gem lettuces",
      "150g pack  hot-smoked salmon flakes",
      "2 tsp caper",
      "50g ready-made croûton",
      "3-4 tbsp Caesar dressing (or make own)"
    ],
    "recipeInstructions": [
      {
        "text": "Put the eggs in a small pan with enough water to cover, then bring to the boil. Boil for 6 mins exactly, drain, cool under running cold water, then peel."
      },
      {
        "text": "Separate the leaves from the lettuces and divide between two bowls. Scatter over the salmon flakes, capers and croûtons. Quarter the eggs, add them to the salad, then drizzle over the Caesar dressing and serve at once."
      }
    ]
  },
  {
    "name": "Lamb with spicy chickpeas",
    "description": "A storecupboard favourite, harissa can turn a bit of meat into a real treat. Leftovers make a good salad too",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9643_11-fe8ed02.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/lamb-spicy-chickpeas",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 600 kcal or less, Cauliflower, Chickpea, Chickpeas, Chops, Cumin seed, Cumin seeds, Cutlets, Good Food, Harissa, Harissa paste, Lamb, Mains, Pulses, Quick, Red onion, Red onions",
    "cookTime": "PT15M",
    "totalTime": "PT20M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "521 calories",
      "fatContent": "26 grams fat",
      "saturatedFatContent": "8 grams saturated fat",
      "carbohydrateContent": "30 grams carbohydrates",
      "sugarContent": "8 grams sugar",
      "fiberContent": "9 grams fiber",
      "proteinContent": "44 grams protein",
      "sodiumContent": "1.03 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "4 lean lamb cutlets or chops",
      "1 tbsp olive oil",
      "1 red onion chopped",
      "1⁄2 small cauliflower cut into small florets",
      "2 tsp cumin seed",
      "2 tsp harissa paste",
      "400g can chickpea drained and rinsed",
      "2 tbsp chopped  parsley",
      "squeeze orange juice"
    ],
    "recipeInstructions": [
      {
        "text": "Heat grill to high. Season the lamb, then grill for 5 mins each side until browned. Meanwhile, heat the oil in a pan, add the onion, then fry for 2 mins."
      },
      {
        "text": "Stir in the cauliflower, cumin and harissa paste, then cook for 1 min more. Add 200ml water, season well, then bring to the boil. Cover, cook for 5 mins until the cauliflower is just tender, then stir in the chickpeas and cook for 2 mins more. Stir in the parsley and orange juice, then serve with the lamb."
      }
    ]
  },
  {
    "name": "Lemon chicken with spring veg noodles",
    "description": "Forget that ready meal, this storecupboard meal makes a speedy after work supper",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9413_11-dc7d824.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/lemon-chicken-spring-veg-noodles",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 20 minutes, 600 kcal or less, Asian, Cashew, Cashews, Chicken, Chicken breast, Chinese, Cornflour, Egg noodle, Egg noodles, Frozen pea, Frozen peas, Ginger, Good Food, Kids cooking, Lemon, Lemons, Mains, Noodles, Peas, Quick, Spring vegetables",
    "cookTime": "PT15M",
    "totalTime": "PT20M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "553 calories",
      "fatContent": "12 grams fat",
      "saturatedFatContent": "2 grams saturated fat",
      "carbohydrateContent": "69 grams carbohydrates",
      "sugarContent": "12 grams sugar",
      "fiberContent": "6 grams fiber",
      "proteinContent": "47 grams protein",
      "sodiumContent": "1.1 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "1 tbsp sunflower oil",
      "2 skinless chicken breasts cut into strips",
      "zest and juice 1 lemon",
      "1 tbsp caster sugar",
      "2 tbsp grated fresh root ginger",
      "2 tsp cornflour",
      "125g pack or 2 sheets medium dried egg noodle",
      "200g frozen pea and bean mix",
      "4 spring onions sliced",
      "1 tbsp roasted cashews"
    ],
    "recipeInstructions": [
      {
        "text": "Heat the oil in a non-stick pan, then fry the chicken for 5 mins until almost cooked. Tip onto a plate. Pour 250ml water into the pan with the lemon zest and juice, sugar and ginger. In a bowl, mix the cornflour with a little water until smooth, then whisk into the pan. Bring to the boil, stirring, then add the chicken to the sauce. Reduce the heat. Bubble for a few mins until chicken is cooked and the sauce thickened."
      },
      {
        "text": "Meanwhile, cook the noodles and veg together in boiling water for 4 mins, then drain. Toss together the chicken, noodles, veg and spring onions; serve scattered with nuts."
      }
    ]
  },
  {
    "name": "Asparagus pasta with mint pesto",
    "description": "A simple solution to dinner made with simple ingredients. Asparagus is at its best around May",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9418_12-d1b0d61.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/asparagus-pasta-mint-pesto",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 600 kcal or less, Asparagus, Beginners, Farfalle, Good Food, Italian, Mains, Pasta, Quick, Ricotta, Risotto, Spring vegetables",
    "cookTime": "PT10M",
    "totalTime": "PT15M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "507 calories",
      "fatContent": "13 grams fat",
      "saturatedFatContent": "7 grams saturated fat",
      "carbohydrateContent": "7 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "4 grams fiber",
      "proteinContent": "79 grams protein",
      "sodiumContent": "0.43 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Pasta, Snack, Supper",
    "recipeIngredients": [
      "large bunch mint (about 80g), leaves stripped",
      "250g tub ricotta",
      "25g parmesan plus extra to serve",
      "400g farfalle (pasta bows)",
      "200g asparagus tips"
    ],
    "recipeInstructions": [
      {
        "text": "In a food processor, briefly whizz the mint leaves, ricotta and grated Parmesan until you have a smooth green pesto. Season well."
      },
      {
        "text": "Boil the pasta, dropping in the asparagus tips 2-3 mins before the cooking time is up. When you drain the pasta, keep back a few tbsp of the water, then return the pasta, asparagus and water to the saucepan."
      },
      {
        "text": "Quickly stir in the mint pesto, divide between 4 plates, then shave over the remaining Parmesan to serve."
      }
    ]
  },
  {
    "name": "Lamb steaks with hummus new potatoes",
    "description": "The hummus potatoes are the perfect addition to flavoursome spring lamb in this recipe",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9422_11-72cec04.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/lamb-steaks-hummus-new-potatoes",
    "keywords": "Beginners, Cherry tomato, Cherry tomatoes, Good Food, Green olive, Green olives, Houmous, Hummus, Lamb, Lamb steaks, Make ahead, New potato, New potatoes",
    "cookTime": "PT18M",
    "totalTime": "PT20M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "552 calories",
      "fatContent": "23 grams fat",
      "saturatedFatContent": "7 grams saturated fat",
      "carbohydrateContent": "43 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "46 grams protein",
      "sodiumContent": "1.7 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "500g new potatoes",
      "2 lamb leg steaks",
      "1 tsp olive oil",
      "bunch cherry tomatoes on the vine",
      "3 tbsp hummus",
      "10 pitted green olives roughly chopped",
      "small handful flat-leaf parsley chopped"
    ],
    "recipeInstructions": [
      {
        "text": "Cook the potatoes in boiling salted water for 15 mins or until tender. Meanwhile, heat the grill or a griddle pan. When the potatoes are almost ready, season the lamb steaks, rub with a little oil, then griddle or grill for 3-4 mins on each side until they are cooked to your liking, adding the tomatoes halfway through until juicy and bursting."
      },
      {
        "text": "When the potatoes are ready, drain well, then return to the pan and gently crush with a fork or potato masher. Stir through the hummus, olives and parsley, then season well. Serve the crushed potatoes with the lamb and the tomatoes."
      }
    ]
  },
  {
    "name": "Sausages with coleslaw",
    "description": "Sometimes nothing will beat a good sausage, team them with our fruity coleslaw for a fresh taste",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9440_11-67862c1.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/sausages-fruity-coleslaw",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 600 kcal or less, Apple, Apples, Carrot, Carrots, Chipolatas, Coleslaw, Good Food, Lime, Limes, Mains, Quick, Redcurrant jelly, Salad, Sausages, White cabbage, White cabbages",
    "cookTime": "PT10M",
    "totalTime": "PT20M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "420 calories",
      "fatContent": "27 grams fat",
      "saturatedFatContent": "8 grams saturated fat",
      "carbohydrateContent": "34 grams carbohydrates",
      "sugarContent": "27 grams sugar",
      "fiberContent": "5 grams fiber",
      "proteinContent": "12 grams protein",
      "sodiumContent": "1.63 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "12 chipolatas sausages",
      "4 tbsp redcurrant jelly",
      "2 tbsp olive oil",
      "juice ½ lime",
      "¼  white cabbage shredded",
      "4 carrots grated",
      "½  red onion sliced",
      "1 red apple cored and sliced"
    ],
    "recipeInstructions": [
      {
        "text": "Heat grill to medium and snip sausages apart into a roasting tin. Whisk the jelly and oil together well, then use 1 tbsp of the mix to coat the sausages. Grill for 8-10 mins, turning, until cooked through and sticky."
      },
      {
        "text": "Meanwhile, whisk the lime juice into the remaining redcurrant mixture, then pour into a large bowl. Add the shredded cabbage, carrot, onion and apple and give everything a good mix with some seasoning. Serve the fruity coleslaw with the sausages and split jacket potatoes."
      }
    ]
  },
  {
    "name": "Spiced mackerel on toast with beetroot salsa",
    "description": "A tin of fish in the cupboard can make an easy supper or lunch. This dish is perfect for a speedy weekend lunch for friends",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9460_11-c60190c.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/spiced-mackerel-toast-beetroot-salsa",
    "keywords": "Apple, Apples, Beetroot, Ciabatta, Cumin seed, Cumin seeds, Curry powder, Good Food, Heart Healthy, Lunch, Mackerel, Mackerels, Makeral, Oliy fish, Omega 3, Quick, Salsa, Sourdough bread",
    "cookTime": "PT5M",
    "totalTime": "PT15M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "471 calories",
      "fatContent": "27 grams fat",
      "saturatedFatContent": "5 grams saturated fat",
      "carbohydrateContent": "35 grams carbohydrates",
      "sugarContent": "11 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "25 grams protein",
      "sodiumContent": "0.97 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Lunch, Main course, Snack, Supper",
    "recipeIngredients": [
      "250g pack beetroot (not in vinegar), diced",
      "1 eating apple cut into wedges then thinly sliced",
      "1 small red onion finely sliced",
      "juice ½ lemon",
      "1 tbsp olive oil plus extra for drizzling",
      "1 tsp cumin seed",
      "small bunch coriander leaves roughly chopped",
      "4 mackerel fillets, halved widthways",
      "1 tsp curry powder",
      "4 slices sourdough bread or ciabatta"
    ],
    "recipeInstructions": [
      {
        "text": "Mix the beetroot, apple, onion, lemon juice, oil, cumin and coriander together, season well, then set aside while you cook the mackerel. Heat the grill to high. Put the fish onto a sheet of foil on the grill rack, sprinkle over the curry powder, drizzle with oil, then season and rub well into the fish."
      },
      {
        "text": "Grill for 4-5 mins until the skin is crisp and the fillets are cooked through; you won’t need to turn the fish over. Toast the bread in a toaster or alongside the fish under the grill, then drizzle with a little olive oil. Top with the salsa and mackerel, then pour over any pan juices and eat straight away."
      }
    ]
  },
  {
    "name": "Smoked trout & cucumber sesame noodles",
    "description": "Fast becoming as popular as salmon, trout has been a forgotten gem for two long. Make the most of it in this fresh salad",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9465_11-141225c.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/smoked-trout-cucumber-sesame-noodles",
    "keywords": " Josh Eagleton, 10-30 minutes, 2 servings, 600 kcal or less, Cucumber, Cucumbers, Good Food, Mains, Noodles, Oily fish, Quick, Sesame seed, Sesame seeds, Smoked trout, Soba, Soba noodle, Soba noodles, Tahini paste, Trout",
    "cookTime": "PT15M",
    "totalTime": "PT15M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "432 calories",
      "fatContent": "17 grams fat",
      "saturatedFatContent": "3 grams saturated fat",
      "carbohydrateContent": "46 grams carbohydrates",
      "sugarContent": "7 grams sugar",
      "fiberContent": "6 grams fiber",
      "proteinContent": "27 grams protein",
      "sodiumContent": "3.61 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Snack, Supper",
    "recipeIngredients": [
      "1.2l vegetable stock",
      "knob fresh root ginger peeled and shredded",
      "100g soba noodle",
      "1 tbsp reduced-salt soy sauce plus extra to serve if you like",
      "1 tbsp tahini paste or peanut butter",
      "125g pack smoked trout fillets, flaked",
      "½  large cucumber sliced",
      "6 spring onions finely sliced",
      "sesame seed to serve",
      "sesame oil to serve"
    ],
    "recipeInstructions": [
      {
        "text": "Bring the stock and shredded ginger to the boil in a large pan, add the noodles, then simmer for 4 mins until tender."
      },
      {
        "text": "Drain, then cool under cold running water. Mix together the soy, tahini and 2 tbsp water (or more if you need) to make a dressing the consistency of single cream. Toss the cooled noodles and fish with the dressing and cucumber. Scatter with the spring onions and sesame seeds, then drizzle with a little sesame oil, if using."
      }
    ]
  },
  {
    "name": "Tuna with peppery tomatoes & potatoes",
    "description": "Sweet peppers make a great addition to grilled meats and fish. A great al fresco meal with fresh flavours",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9469_12-ee6b6e4.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/tuna-peppery-tomatoes-potatoes",
    "keywords": "2 of 5-a-day, Cherry tomato, Cherry tomatoes, Fish, Good Food, Green chilli, Green chillli, Grill, Grilled, Heart Healthy, New potato, New potatoes, Oily fish, Omega 3, Red pepper, Red peppers, Summery, Thyme, Tuna, Tuna steaks",
    "cookTime": "PT25M",
    "totalTime": "PT35M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "371 calories",
      "fatContent": "11 grams fat",
      "saturatedFatContent": "2 grams saturated fat",
      "carbohydrateContent": "31 grams carbohydrates",
      "sugarContent": "11 grams sugar",
      "fiberContent": "4 grams fiber",
      "proteinContent": "40 grams protein",
      "sodiumContent": "0.48 milligram of sodium"
    },
    "recipeCategory": "Dinner, Lunch, Main course, Supper",
    "recipeIngredients": [
      "4 tuna steaks",
      "1 tbsp olive oil",
      "3 garlic cloves crushed",
      "few thyme sprigs",
      "500g bag new potato sliced about 1cm thick",
      "2 red peppers cut into large chunks",
      "1 red onion cut into eighths",
      "1 green chilli deseeded and chopped",
      "400g can cherry tomato"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 220C/fan 200C/gas 7 and put in a roasting tin to heat up. Put the tuna in a shallow dish with half the oil, two-thirds of the garlic and leaves from 1 sprig of thyme. Leave to marinate while you cook the veg."
      },
      {
        "text": "Put the potatoes, peppers, onion and chilli into the roasting tin with the remaining oil, toss to coat, then roast for 20 mins. The potatoes should be tender or very nearly there. If not, give them another 5 mins (the cooking time can depend on the variety of potato). Add the remaining garlic and thyme to the pan, let them sizzle, stir in the tomatoes, then cook for 5 mins more until the sauce has reduced a little. Season to taste."
      },
      {
        "text": "With a few mins to go, heat a griddle or frying pan, wipe most of the garlic marinade off the fish with kitchen paper, season, then sear for 1 min each side for medium or longer if you prefer. Serve on top of the veg."
      }
    ]
  },
  {
    "name": "Dover sole with buttered leeks & shrimps",
    "description": "April, May and June are prime months for Dover sole. Easy and quick to prepare, this fish is often overlooked says CJ Jackson",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9486_11-6327476.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/dover-sole-buttered-leeks-shrimps",
    "keywords": " Josh Eagleton, Barney Desmazery, Chive, Chives, Dover sole, Fish, In season, Leek, Leeks, May, Potted shrimp, Potted shrimps, Sole, Sustainable, White fish, White wine",
    "cookTime": "PT30M",
    "totalTime": "PT40M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "673 calories",
      "fatContent": "43 grams fat",
      "saturatedFatContent": "24 grams saturated fat",
      "carbohydrateContent": "10 grams carbohydrates",
      "sugarContent": "9 grams sugar",
      "fiberContent": "6 grams fiber",
      "proteinContent": "56 grams protein",
      "sodiumContent": "4.26 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course",
    "recipeIngredients": [
      "50g butter",
      "2 Dover sole about 350g/12oz each, trimmed and top skin removed",
      "small glass white wine about 125ml/4 fl oz",
      "4 leeks cut into large chunks",
      "100g tub potted shrimp",
      "small bunch chives snipped"
    ],
    "recipeInstructions": [
      {
        "text": "Heat the oven to 220C/fan 200C/gas 7. Lightly butter a large roasting tray and lay the fish in it side by side. Pour over the wine and dot the fish with any remaining butter. Season with salt and pepper, then bake for 15-20 mins or until the flesh just starts to come away from the bone."
      },
      {
        "text": "Meanwhile, cook the leeks in boiling salted water for 8-10 mins until soft, then drain. When the fish is ready, carefully lift onto a warm platter or plates. Place the roasting tray over a low flame, then heat the leeks and potted shrimps with the juices until the butter is melted. Stir through the chives, then serve alongside the fish with a few buttered new potatoes. To eat, simply lift the fillets away from the bone."
      }
    ]
  },
  {
    "name": "Hot-smoked salmon salad with a chilli lemon dressing",
    "description": "This delicious salad is thrown together in minutes to make a fresh, seasonal dish that’s stylish enough for entertaining",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9520_11-de1b4e5.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/hot-smoked-salmon-salad-chilli-lemon-dressing",
    "keywords": " Josh Eagleton, 10-30 minutes, 30 minutes, 30-60 minutes, 400 kcal or less, Asparagus, Good Food, Hot-smoked salmon, Mains, Mixed salad leaves, New potato, New potatoes, Quick, Radish, Radishes, Red chilli, Red chillies, Salad, Salmon, Smoked salmon",
    "cookTime": "PT10M",
    "totalTime": "PT30M",
    "recipeYield": 8,
    "nutrition": {
      "calories": "299 calories",
      "fatContent": "19 grams fat",
      "saturatedFatContent": "3 grams saturated fat",
      "carbohydrateContent": "13 grams carbohydrates",
      "sugarContent": "3 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "21 grams protein",
      "sodiumContent": "2.09 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Lunch, Main course, Side dish, Snack, Starter, Supper",
    "recipeIngredients": [
      "500g new potato halved",
      "200g pack asparagus tips",
      "250g bag mixed salad leaves (including young beetroot leaves and watercress)",
      "bunch each parsley and mint, leaves picked and roughly chopped",
      "140g radish thinly sliced",
      "8 x hot-smoked salmon steaks, skin removed",
      "4 spring onions sliced diagonally",
      "3 tbsp lemon juice",
      "125ml olive oil",
      "1 tsp wholegrain mustard",
      "2 red chillies"
    ],
    "recipeInstructions": [
      {
        "text": "Boil potatoes in salted water for 10 mins until tender, adding the asparagus tips for the final 2 mins of cooking. Drain and allow to cool. Whisk together the salad dressing ingredients. then season to taste."
      },
      {
        "text": "In a large bowl, toss together the potatoes, asparagus, salad leaves, herbs and radishes. Add two-thirds of the dressing, thoroughly mix through the salad, then spread the salad over a large platter. Break the hot-smoked salmon into large chunks, then scatter over the top along with the spring onions. Finish by pouring remaining dressing over the top."
      }
    ]
  },
  {
    "name": "White chocolate, raspberry & hazelnut marble torte",
    "description": "Good enough to impress any crowd, this can be made ahead and whipped out of the fridge an hour before serving",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9529_12-450b1e1.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/white-chocolate-raspberry-hazelnut-marble-torte",
    "keywords": " Josh Eagleton, Alcohol, Booze, CAKE, Centrepiece, Disaronno, Dissaronno, Egg white, Egg whites, Fangelico, Good Food, Hazelnut, Hazelnuts, Indulgent, Leaf gelatine, Liqueur, Make ahead, Mousse, Raspberries, Raspberry, Sponge, Torte, White chocolate",
    "cookTime": "PT1H",
    "totalTime": "PT1H50M",
    "recipeYield": 10,
    "nutrition": {
      "calories": "879 calories",
      "fatContent": "67 grams fat",
      "saturatedFatContent": "34 grams saturated fat",
      "carbohydrateContent": "59 grams carbohydrates",
      "sugarContent": "48 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "12 grams protein",
      "sodiumContent": "0.99 milligram of sodium"
    },
    "recipeCategory": "Afternoon tea, Dessert, Treat",
    "recipeIngredients": [
      "140g hazelnut toasted",
      "140g golden caster sugar",
      "140g self-raising flour",
      "1 tsp bicarbonate of soda",
      "3 eggs separated",
      "140g butter melted",
      "75ml milk",
      "400g white chocolate broken into chunks",
      "2 sheets leaf gelatine",
      "586ml pot double cream",
      "3 egg whites",
      "450g frozen raspberry plus a few extra to decorate",
      "4 tbsp Frangelico hazelnut liqueur or Disaronno",
      "icing sugar for dusting",
      "100g white chocolate to make chocolate curls (see know-how below)"
    ],
    "recipeInstructions": [
      {
        "text": "For the sponge, heat oven to 180C/fan 160C/gas 4, then grease and line the base of a deep 22cm springform cake tin. Finely chop the toasted hazelnuts in a food processor, then tip into a bowl with the sugar, flour and bicarbonate of soda. Whisk the egg whites until stiff, then quickly stir the butter, milk and yolks into the dry ingredients. When the mixture is smooth, stir in one-third of the egg whites, then gently fold in the rest. Pour the mixture into the prepared tin, bake for 40-50 mins until the cake is golden andspringy to touch, then allow to cool."
      },
      {
        "text": "For the mousse, melt the chocolate in a glass bowl set over a pan of barely simmering water, then let it cool slightly. Soften the gelatine in water, squeeze out, then put in a small pan with 100ml of the cream. Gently warm over a low heat until the gelatine is melted (you shouldn’t be able to see any clear streaks in the cream), then tip into a bowl with the remaining cream and egg whites. Make sure you thoroughly scrape out the pan so no gelatine is left behind. Beat until it holds its shape, then spoon a quarter of this creamy mixture into the melted chocolate. Mix briefly until smooth. Fold in the remaining cream mix and raspberries, swirling the mixture so the berries begin to marble the mousse, then set aside until the cake is cool."
      },
      {
        "text": "To assemble, split the sponge in half and re-line the base of the cake tin with baking parchment. Use a long continuous strip of baking parchment to wrap around and line the inside, as this will help to make the sides of the finished torte look smooth. Press the bottom half of the cake back into the tin, sprinkle with half of the liqueur, then gently spoon over the mousse. Sprinkle the cut side of the top cake with the remaining liqueur and put this, liqueur-soaked side down, on top of the mousse. Press down gently, wrap the entire tin in cling film, then chill overnight."
      },
      {
        "text": "To serve, remove the torte from the fridge about 1 hr before you want to eat it, release from the tin, then gently peel off the baking parchment. Lightly dust the top of the torte with icing sugar, then pile on the chocolate curls (see box, below) and a few raspberries."
      }
    ]
  },
  {
    "name": "Dressed spring cabbage",
    "description": "Spring cabbage is well worth looking out for as it has a wonderfully nutty flavour",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9585_11-c89ee30.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/dressed-spring-cabbage",
    "keywords": " Josh Eagleton, 10-30 minutes, 200 kcal or less, 4 servings, Cabbage, Good Food, Mains, Quick, Side dish, Spring, Streaky bacon, White wine vinegar",
    "cookTime": "PT10M",
    "totalTime": "PT15M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "90 calories",
      "fatContent": "6 grams fat",
      "saturatedFatContent": "1 grams saturated fat",
      "carbohydrateContent": "5 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "4 grams fiber",
      "proteinContent": "5 grams protein",
      "sodiumContent": "0.29 milligram of sodium"
    },
    "recipeCategory": "Dinner, Side dish",
    "recipeIngredients": [
      "1 ½ tbsp white wine vinegar",
      "1 tsp caster sugar",
      "2 rashers smoked streaky bacon cut into small strips",
      "1 tbsp olive oil",
      "1 spring green cabbage shredded"
    ],
    "recipeInstructions": [
      {
        "text": "Mix the vinegar with 1 tbsp water and the sugar. In a large frying pan, fry the bacon in oil until golden, then lift onto a plate."
      },
      {
        "text": "Add the cabbage to the pan, cook for 5 mins over a high heat, then stir through the dressing. Return the bacon to the pan and cook for 1 min more to warm through. Season well with pepper and serve."
      }
    ]
  },
  {
    "name": "Sesame baby carrots",
    "description": "This recipe makes the most of baby carrot's sweet young flavour, perfect with the nuttiness of the sesame seeds",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9576_11-9a054a0.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/sesame-baby-carrots",
    "keywords": " Josh Eagleton, 10-30 minutes, 200 kcal or less, 4 servings, Baby carrot, Carrot, Good Food, Mains, Quick, Sesame seed, Sesame seeds, Side, Side dish, Sides",
    "cookTime": "PT15M",
    "totalTime": "PT20M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "127 calories",
      "fatContent": "10 grams fat",
      "saturatedFatContent": "4 grams saturated fat",
      "carbohydrateContent": "8 grams carbohydrates",
      "sugarContent": "8 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "1 grams protein",
      "sodiumContent": "0.21 milligram of sodium"
    },
    "recipeCategory": "Dinner, Side dish",
    "recipeIngredients": [
      "450g baby carrot",
      "25g butter",
      "1 tsp light muscovado sugar",
      "1 tbsp sesame oil",
      "1 tbsp toasted sesame seed"
    ],
    "recipeInstructions": [
      {
        "text": "Place the carrots in a large frying pan in one layer. Dot over the butter and half cover with 200ml cold water. Bring to the boil, then simmer for about 8 mins until the liquid is almost all evaporated."
      },
      {
        "text": "Sprinkle with sugar, add the sesame oil and toss the carrots in the buttery juices over a low heat for about 4 mins until glossy. Serve mixed with the sesame seeds."
      }
    ]
  },
  {
    "name": "Deep-filled asparagus & mascarpone tartlets",
    "description": "A fresh starter or canapé. A little skill is require, but once mastered you can easily change the fillings to suit the seasons",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9588_11-c1cc894.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/deep-filled-asparagus-mascarpone-tartlets",
    "keywords": " Josh Eagleton, 400 kcal or less, Asparagus, Asparagus spear, Asparagus spears, Barney Desmazery, Canape, Egg, Eggs, Filled, For a crowd, Goat's Cheese, Indulgent, Mains, Mascarpone, Over an hour, Puff pastry, Starter, Tart, Tartlet",
    "cookTime": "PT40M",
    "totalTime": "PT1H10M",
    "recipeYield": 12,
    "nutrition": {
      "calories": "316 calories",
      "fatContent": "25 grams fat",
      "saturatedFatContent": "15 grams saturated fat",
      "carbohydrateContent": "16 grams carbohydrates",
      "sugarContent": "2 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "8 grams protein",
      "sodiumContent": "0.48 milligram of sodium"
    },
    "recipeCategory": "Buffet, Canapes, Dinner, Starter",
    "recipeIngredients": [
      "500g block all-butter puff pastry",
      "12 asparagus spears",
      "250g tub mascarpone",
      "4 eggs",
      "100g goat's cheese crumbled"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 200C/fan 180C/gas 6. Roll out the pastry on a lightly floured surface and cut into 12 pieces, roughly 8cm square. Use each piece to line the holes of a 12-hole muffin tin and use a ball of trimmings to press the pastry right down into the corners."
      },
      {
        "text": "Press a large piece of foil over the tin and down into the holes, then fill each with baking beans. Bake for 15 mins until puffed up and golden, then remove the foil and cook for 10 mins more. Don’t worry if the pastry puffs right up."
      },
      {
        "text": "Meanwhile, trim the asparagus and separate the stalks from the tips. Bring a large pan of water to the boil, cook the stalks for 6 mins, then fish them out and place in a bowl of iced water. When cold, drain them again. Cook the tips separately for 3 mins, then place in the iced water. Put the stalks, mascarpone and eggs into a small bowl, season generously with salt and pepper, then use a hand blender to blitz everything to a frothy green custard."
      },
      {
        "text": "Use a spoon to push the pastry back down into the holes and fill each with the custard. Drop an asparagus tip into each, then crumble over the goat’s cheese. Return the tarts to the oven for 10-15 mins until the custard has puffed up and set. Leave to cool before removing from the tins."
      }
    ]
  },
  {
    "name": "Warm salad of spring vegetables with griddled lamb",
    "description": "This warm, dressed salad is delicious on its own, but if you need a bit more bite, grilled lamb is the perfect choice",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9601_12-7907a8e.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/warm-salad-spring-vegetables-griddled-lamb",
    "keywords": "Asparagus, Barney Desmazery, Broad bean, Broad beans, Coriander seed, Coriander seeds, Lamb, Lamb chop, Lamb chops, Mint, Pea, Peas, Podded, Red wine vinegar, Salad, Spring vegetables, Tarragon, Tomato, Tomatoes",
    "cookTime": "PT15M",
    "totalTime": "PT45M",
    "recipeYield": 6,
    "nutrition": {
      "calories": "453 calories",
      "fatContent": "34 grams fat",
      "saturatedFatContent": "13 grams saturated fat",
      "carbohydrateContent": "7 grams carbohydrates",
      "sugarContent": "3 grams sugar",
      "fiberContent": "4 grams fiber",
      "proteinContent": "31 grams protein",
      "sodiumContent": "0.22 milligram of sodium"
    },
    "recipeCategory": "Lunch, Main course, Side dish",
    "recipeIngredients": [
      "1 bunch asparagus trimmed and sliced",
      "140g podded pea frozen are fine",
      "140g podded broad bean frozen are fine",
      "3 tomatoes",
      "6 tbsp olive oil",
      "1 tbsp coriander seed",
      "2 tbsp red wine vinegar",
      "handful tarragon leaves",
      "handful mint leaves",
      "6 large lamb chops"
    ],
    "recipeInstructions": [
      {
        "text": "Get a bowl of iced water at the ready and bring a large pan of salted water to the boil. Cook the asparagus in the water for 3 mins, then scoop into the iced water with a slotted spoon. Cook the peas for 2 mins, then place in the iced water. Cook the broad beans for another 2 mins, pop into the iced water, then remove them from their skins. Cut a cross in the bottom of each tomato, then blanch in boiling water for about 10 secs before placing in iced water. Peel, quarter and deseed the tomatoes and cut the flesh into small chunks."
      },
      {
        "text": "Heat the oil and coriander seeds gently in a small saucepan, then take off the heat and stir through all the veg and the vinegar. Season with salt and pepper, and stir through the tarragon and mint."
      },
      {
        "text": "Heat a large griddle pan or barbecue. Season the lamb with salt and pepper, and cook for 4 mins on each side for medium, or 6 mins for well done. Serve each lamb chop with the vegetable dressing."
      }
    ]
  },
  {
    "name": "BBQ roast chicken & chunky chips",
    "description": "A naughty takeaway favourite made into a real meal. This chicken and chips combo just needs a bit of salad to ensure your halo",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9605_11-07cf1db.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/bbq-roast-chicken-chunky-chips",
    "keywords": " Josh Eagleton, 4 servings, 800 kcal or less, Baking potato, Baking potatoes, Barney Desmazery, BBQ, Beginners, Chicken, Chicken and chips, Chips, Mains, Over an hour, Paprika, Roast chicken",
    "cookTime": "PT1H40M",
    "totalTime": "PT2H",
    "recipeYield": 4,
    "nutrition": {
      "calories": "765 calories",
      "fatContent": "43 grams fat",
      "saturatedFatContent": "11 grams saturated fat",
      "carbohydrateContent": "45 grams carbohydrates",
      "sugarContent": "9 grams sugar",
      "fiberContent": "3 grams fiber",
      "proteinContent": "52 grams protein",
      "sodiumContent": "0.46 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Main course",
    "recipeIngredients": [
      "2 tbsp paprika",
      "2 tbsp light muscovado sugar",
      "4 large baking potatoes unpeeled, cut into chunky wedges",
      "3 tbsp sunflower oil",
      "1 free range chicken about 1.5kg/3lb 5oz"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 190C/fan 170C/gas 5. In a bowl, mix the paprika and sugar together with a couple of generous pinches of salt. Tip the potato wedges in a roomy roasting tin, toss in 2 tbsp oil until coated, then season with some of the paprika mix. Rub chicken with the rest of the oil, season inside and out, then rub all over with the rest of the paprika mix. Push the potatoes to the sides of the tin and sit the chicken in the middle."
      },
      {
        "text": "Roast undisturbed, for 1 hr 20 mins. Remove the chicken, set aside to rest for 20 mins, then use a fish slice to turn the potatoes and lay them in an even layer. Continue roasting the potatoes while the chicken rests, then serve everything together."
      }
    ]
  },
  {
    "name": "Rosemary & balsamic chicken with roast onions",
    "description": "A honey glaze adds a lovely sweetness to a classic roast chicken. Perfect with the tangy sweetness of roasted red onions",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9608_11-de5cf38.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/rosemary-balsamic-chicken-roast-onions",
    "keywords": " Josh Eagleton, 4 servings, 800 kcal or less, Balsamic vinegar, Barney Desmazery, Chicken, Free range, Glazed, Honey, Mains, Over an hour, Red onion, Red onions, Roast chicken, Rosemary",
    "cookTime": "PT1H40M",
    "totalTime": "PT1H50M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "629 calories",
      "fatContent": "42 grams fat",
      "saturatedFatContent": "11 grams saturated fat",
      "carbohydrateContent": "15 grams carbohydrates",
      "sugarContent": "12 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "48 grams protein",
      "sodiumContent": "0.44 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course, Supper",
    "recipeIngredients": [
      "1 free-range chicken about 1.5kg/3lb 5oz",
      "bunch rosemary",
      "3 tbsp olive oil",
      "4 red onions left whole but peeled and trimmed",
      "3 tbsp balsamic vinegar",
      "1 tbsp honey"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 190C/fan 170C/gas 5. Starting at the neck, carefully loosen the breast skin away from the flesh, trying not to tear it, then place a branch of rosemary down the side of each one. Put the rest of the rosemary in the cavity. Season the chicken inside and out, place in a roasting tin, then sit an onion in each corner of the tin. Drizzle the olive oil over the chicken and onions, then roast everything for 1 hr 20 mins."
      },
      {
        "text": "Meanwhile, stir the vinegar and honey together until the honey has dissolved. When the chicken has had about 40 mins, whip it out of the oven, drizzle the chicken and onions with the vinegar mix, then continue to roast until the time is up. Remove the chicken to rest, turn the onions over and continue to roast them in the oven while the chicken rests, about 20 mins. Serve each person a portion of chicken, a roasted onion and some of the sticky pan juices."
      }
    ]
  },
  {
    "name": "Paella fried rice",
    "description": "A great dish when you fancy a taste of the med in an instant. This cheat's paella is as authentic as you can be in 10 minutes!",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9696_11-b9e2a97.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/paella-fried-rice",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 400 kcal or less, Chorizo, Frozen pea, Frozen peas, Good Food, Mains, Prawn, Prawns, Quick, Rice, Seafood, Spain, Tapas, Turmeric, Under 10 minutes",
    "cookTime": "PT5M",
    "totalTime": "PT10M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "347 calories",
      "fatContent": "9 grams fat",
      "saturatedFatContent": "2 grams saturated fat",
      "carbohydrateContent": "50 grams carbohydrates",
      "sugarContent": "3 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "20 grams protein",
      "sodiumContent": "1.19 milligram of sodium"
    },
    "recipeCategory": "Buffet, Dinner, Main course, Side dish, Supper",
    "recipeIngredients": [
      "1 tbsp vegetable oil",
      "2 small chorizo sausages, cut into slices",
      "1 onion sliced",
      "1 garlic clove chopped",
      "½ tsp turmeric",
      "600g cooked plain rice",
      "200g frozen cooked prawn",
      "100g frozen pea",
      "lemon wedges, to serve"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oil in a frying pan. Tip in the chorizo, onion and garlic, then cook for a couple of mins until softened. Stir through turmeric, followed by the rice, prawns and peas and 150ml boiling water."
      },
      {
        "text": "Keep stirring until everything is warmed through and the water has been absorbed. Serve with lemon wedges."
      }
    ]
  },
  {
    "name": "Easy pad Thai",
    "description": "Almost a national dish of Thailand, Mary Cadogan's simplified take makes it easy to shop for - and very authentic tasting",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1900_12-19b9a16.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/easy-pad-thai",
    "keywords": "Asian, Bangkok, Bean sprout, Bean sprouts, Fish sauce, Lime juice, Mary Cadogan, Nam pla, Noodles, Pad Thai, Prawns, Rice noodle, Rice noodles, Salted peanut, Salted peanuts, Spring onion, Spring onions, Thai, Tiger prawn, Tiger prawns",
    "totalTime": "PT30M",
    "recipeYield": "Serves 2-3",
    "nutrition": {
      "calories": "531 calories",
      "fatContent": "20 grams fat",
      "saturatedFatContent": "3 grams saturated fat",
      "carbohydrateContent": "62 grams carbohydrates",
      "sugarContent": "5 grams sugar",
      "fiberContent": "2 grams fiber",
      "proteinContent": "27 grams protein",
      "sodiumContent": "3 milligram of sodium"
    },
    "recipeCategory": "Lunch, Main course, Supper",
    "recipeIngredients": [
      "125g (half a 250g pack) rice noodles",
      "3 tbsp lime juice about 2 limes",
      "½ tsp cayenne pepper",
      "2 tsp light muscovado sugar",
      "2 tbsp fish sauce (nam pla)",
      "2 tbsp vegetable oil",
      "200g cooked and peeled tiger prawn tails left on",
      "4 spring onions sliced",
      "140g beansprout",
      "25g salted peanut finely chopped",
      "a small handful of coriander leaves",
      "1 or 2 lime cut into wedges",
      "sweet chilli sauce"
    ],
    "recipeInstructions": [
      {
        "text": "Put the noodles in a large heatproof bowl, pour boiling water over them and leave for 4 minutes, then drain and refresh under cold running water."
      },
      {
        "text": "Put the lime juice, cayenne, sugar and fish sauce in a bowl and mix well. Have all the other ingredients ready by the cooker."
      },
      {
        "text": "Heat the oil and fry the prawns until warmed through. Add the spring onions and noodles and toss around. Tip in the lime juice mixture, then stir in the beansprouts and half the peanuts and coriander. Cook for 1 minute until everything is heated through."
      },
      {
        "text": "Pile into a large dish, scatter with the rest of the peanuts and coriander, and serve with lime wedges and sweet chilli sauce."
      }
    ]
  },
  {
    "name": "Cheese, leek & potato tortilla",
    "description": "A quick, thick Spanish omelette that's a brilliant way to use up leftover potatoes and cheese with eggs",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-9701_12-f2443c5.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/cheese-leek-potato-tortilla",
    "keywords": " Josh Eagleton, 10-30 minutes, 4 servings, 400 kcal or less, Beginners, Cheddar, Easy, Egg, Eggs, Good Food, Leek, Leeks, Leftovers, Mains, Omlette, Potato, Potatoes, Quick, Quick supper, Sage, Spain, Spanish, Tapas, Vegetarian",
    "cookTime": "PT12M",
    "totalTime": "PT22M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "277 calories",
      "fatContent": "19 grams fat",
      "saturatedFatContent": "9 grams saturated fat",
      "carbohydrateContent": "11 grams carbohydrates",
      "sugarContent": "1 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "16 grams protein",
      "sodiumContent": "0.81 milligram of sodium"
    },
    "recipeCategory": "Brunch, Dinner, Lunch, Main course, Side dish, Supper",
    "recipeIngredients": [
      "butter for frying",
      "1   leek thinly sliced",
      "225g potatoes cooked and cooled (about 1-2 medium size ones)",
      "6 eggs",
      "85g cheddar",
      "1 tbsp sage finely chopped (or 1 tsp dried sage), optional"
    ],
    "recipeInstructions": [
      {
        "text": "Melt a knob of butter in a medium, nonstick frying pan, then cook the leek for about 5 mins until softened. Meanwhile, cut the potatoes in half, then into slices about ½cm thick. Beat the eggs, season, then stir in the cheese and sage."
      },
      {
        "text": "Add a little extra butter to the pan if needed, tip in the potatoes, then the egg mixture. Turn the heat to low, then cook for 10 mins until nearly set. Place under a hot grill, then cook for a couple of mins more until the top is set and golden. Slice into wedges and serve with a green salad."
      }
    ]
  }
]