[
  {
    "name": "Crispy pork & vegetable rolls",
    "description": "Crispy Thai rolls with pork and vegetables - great for a starter. You can make these ahead and freeze",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1081463_11-ac97650.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/crispy-pork-vegetable-rolls",
    "keywords": "30-60 minutes, 400 kcal or less, 6 servings, Crispy spring rolls, Dipping starters, Finger foods, Mary Cadogan, Minced pork, Thai starter, Vermicelli rice noodle, Vermicelli rice noodles",
    "totalTime": "PT45M",
    "recipeYield": "Serves 6, with other dishes",
    "nutrition": {
      "calories": "307 calories",
      "fatContent": "16 grams fat",
      "saturatedFatContent": "2 grams saturated fat",
      "carbohydrateContent": "36 grams carbohydrates",
      "sugarContent": "3 grams sugar",
      "fiberContent": "1 grams fiber",
      "proteinContent": "7 grams protein",
      "sodiumContent": "2.11 milligram of sodium"
    },
    "recipeCategory": "Buffet, Canapes",
    "recipeIngredients": [
      "2 tbsp cornflour",
      "50g vermicelli rice noodles",
      "100g minced pork",
      "1 garlic clove finely chopped",
      "1 carrot grated",
      "50g oyster mushroom finely chopped",
      "2 tbsp  finely chopped coriander",
      "2 tbsp light  soy sauce",
      "1 tsp sugar",
      "¼ tsp ground white peppercorns",
      "7-8  spring roll wrappers (try an oriental foodshop, if you find them, buy extra and freeze)",
      "vegetable oil for frying",
      "iceberg lettuce or cos lettuce and mint sprigs, to serve",
      "sweet chilli sauce for dipping"
    ],
    "recipeInstructions": [
      {
        "text": "Blend the cornflour with 3 tbsp cold water to make a paste to stick the rolls together. Put the noodles in a heatproof bowl, pour over boiling water to cover and leave for 3 minutes. Drain. Cool under running cold water, then drain well, tip into a large bowl and snip into small pieces with scissors."
      },
      {
        "text": "Add the pork, garlic, carrot, mushrooms, coriander, soy sauce, sugar and pepper. Mix together well with your hands."
      },
      {
        "text": "Take one wrapper out of the pack and put it on a board (keep the rest covered or they will dry out). Cut the wrapper in four and put a heaped teaspoon of filling onto one side of each square, brushing the sides with paste as you go (1), fold over the end, then the two sides (2) and roll up (3). Make the rest in the same way. Cover and chill until needed."
      },
      {
        "text": "Heat about 3cm of oil in a wok or frying pan, add half the rolls and fry until crisp and golden, about 2-3 minutes. Drain on kitchen paper and cook the rest. Serve on a platter with lettuce leaves, mint sprigs and a small bowl of dipping sauce. Get each guest to take a leaf of lettuce and a mint spring, then wrap it around a roll with a slick of sauce – a lovely combination."
      }
    ],
    "skillLevel": "More effort",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/crispy-pork-vegetable-rolls"
  }
]