[
  {
    "name": "Fluffy Japanese pancakes",
    "description": "Whip up these fluffy pancakes and enjoy with your favourite toppings – butter, maple syrup, honey, fruit or whipped cream all work well",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2024/06/FluffyJapanesePancakes-e6d7773.jpg?resize=768,713",
        "width": 768,
        "height": 713
      },
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2024/06/FluffyJapanesePancakes-e6d7773.jpg?resize=900,836",
        "width": 900,
        "height": 836
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/fluffy-japanese-pancakes-2",
    "keywords": "Eggs, japanese pancakes, Pancakes",
    "prepTime": "PT25M",
    "cookTime": "PT8M",
    "totalTime": "PT33M",
    "recipeYield": 4,
    "nutrition": {
      "calories": "89 calories",
      "fatContent": "3 grams fat",
      "saturatedFatContent": "1 grams saturated fat",
      "carbohydrateContent": "13 grams carbohydrates",
      "sugarContent": "7 grams sugar",
      "fiberContent": "0.3 grams fiber",
      "proteinContent": "3 grams protein",
      "sodiumContent": "0.09 milligram of sodium"
    },
    "recipeCategory": "Breakfast, Brunch",
    "recipeIngredients": [
      "2 eggs separated (you will have 1 yolk leftover, which can be frozen to use in another recipe)",
      "25g natural full-fat yogurt",
      "70g whole milk",
      "70g plain flour",
      "¼ tsp vanilla extract",
      "13g unsalted butter",
      "25g caster sugar",
      "vegetable oil or spray oil for frying",
      "butter, maple syrup, honey, berries or whipped cream to serve (optional)"
    ],
    "recipeInstructions": [
      {
        "text": "Put the two egg whites into a small bowl and freeze for 10 mins until just starting to freeze at the edges."
      },
      {
        "text": "Meanwhile, put one of the egg yolks in a medium bowl with the yogurt and milk, and mix well. Sift in the flour and whisk it in, followed by the vanilla – it should resemble a runny custard. Fill a larger bowl with ice, then sit the medium bowl on top to keep the batter cold."
      },
      {
        "text": "Melt the butter in a pan over a low heat and, as soon as it's liquid, pour the butter into the flour mixture, whisking lightly until just combined. Remove the egg whites from the freezer, put in a stand mixer and whisk briefly. Gradually add the sugar, and continue to whisk for 3 mins until you have a fluffy meringue. Spoon the meringue into the flour mixture, and gently fold in using a large metal spoon or spatula until fully incorporated, being careful not to over-mix."
      },
      {
        "text": "Heat a drizzle of oil (or mist with spray oil) in a large lidded frying pan over a low-medium heat and wipe out the excess using kitchen paper. The pan needs to be hot enough to cook the pancakes, but not so hot that it burns the outside without cooking the centre. Spoon the batter into a piping bag with the tip cut off (you want about a 1.5cm hole). Pipe a circle into the hot frying pan, then pipe concentric circles on top of the first, until the pancake is about 5-8cm high. Cover with the lid and cook for 3 mins, then carefully flip over and cook for another 3 mins. Repeat with the remaining batter."
      },
      {
        "text": "Divide the cooked pancakes between plates and serve with your favourite toppings."
      }
    ],
    "skillLevel": "More effort",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/fluffy-japanese-pancakes"
  }
]