[
  {
    "name": "Moroccan chicken",
    "description": "You don't need a clay pot to whip up a fragrant, North African tagine. Make this Moroccan chicken in a casserole dish and top with feta, mint and lemon.",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1096452_11-cec9a5b.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/moroccan-chicken-one-pot",
    "keywords": "3 of five a day, Casserole, Chicken casserole, Cover recipe, Family, Fibre, Fragrant, goodhealth, Low cal, Low calorie, Low fat, Make ahead, Marrakech, Morrocan, North africa, Sarah Cook, Tagine",
    "prepTime": "PT20M",
    "cookTime": "PT50M",
    "totalTime": "PT1H10M",
    "recipeYield": 6,
    "nutrition": {
      "calories": "324 calories",
      "fatContent": "7 grams fat",
      "saturatedFatContent": "1 grams saturated fat",
      "carbohydrateContent": "39 grams carbohydrates",
      "sugarContent": "24 grams sugar",
      "fiberContent": "6 grams fiber",
      "proteinContent": "27 grams protein",
      "sodiumContent": "0.4 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course",
    "recipeIngredients": [
      "4 boneless, skinless chicken breasts",
      "3 tbsp olive oil",
      "2 onions 1 roughly chopped, 1 sliced",
      "100g tomatoes",
      "100g ginger roughly chopped",
      "3 garlic cloves",
      "1 tsp turmeric",
      "1 tbsp each ground cumin coriander and cinnamon",
      "1 large butternut squash deseeded and cut into big chunks",
      "600ml chicken stock",
      "2 tbsp brown sugar",
      "2 tbsp red wine vinegar",
      "100g dried cherries",
      "1 small red onion finely chopped",
      "zest 1 lemon",
      "handful mint leaves",
      "100g feta cheese crumbled",
      "couscous and natural yogurt"
    ],
    "recipeInstructions": [
      {
        "text": "Season 4 boneless, skinless chicken breasts. Heat 2 tbsp olive oil in a flameproof dish, then brown the chicken on all sides. Remove the chicken to a plate."
      },
      {
        "text": "Whizz 1 chopped onion, 100g tomatoes, 100g chopped ginger and 3 garlic cloves into a rough paste."
      },
      {
        "text": "Fry 1 sliced onion in 1 tbsp olive oil in the dish until softened, then add 1 tsp turmeric, 1 tbsp cumin, 1 tbsp coriander and 1 tbsp cinnamon and fry for 1 min more until fragrant. Add the paste and fry for another few mins to soften."
      },
      {
        "text": "Return the chicken to the dish with 1 large butternut squash, cut into big chunks, 600ml chicken stock, 2 tbsp brown sugar and 2 tbsp red wine vinegar."
      },
      {
        "text": "Bring to a simmer, then cook for 30 mins until the chicken is cooked through."
      },
      {
        "text": "Lift the chicken out and stir in 100g dried cherries, then continue simmering the sauce to thicken while you shred the chicken into bite-sized chunks. Stir the chicken back into the sauce and season."
      },
      {
        "text": "Mix 1 finely chopped small red onion, the zest of 1 lemon, a handful of mint leaves and 100g crumbled feta cheese. Scatter over the dish, then serve with couscous and natural yogurt."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/moroccan-chicken"
  },
  {
    "name": "Simple squash risotto",
    "description": "Roasted squash gives this vegetarian supper for two a deep autumnal flavour",
    "image": [
      {
        "url": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-328145_11-81ec57f.jpg?resize=440,400",
        "width": 440,
        "height": 400
      }
    ],
    "url": "https://www.bbcgoodfood.com/recipes/simple-squash-risotto",
    "keywords": "2 servings, 30-60 minutes, Autumn, Butternut squash, Butternut squash risotto, Good Food, Italian, Mains, Over 800 kcal, Parmesan, Pumpkin risotto, Risotto rice, Rissoto, Rissotto, Roasted butternut squash, Serves two, Vegetarian recipes, Weekend recipes",
    "prepTime": "PT20M",
    "cookTime": "PT35M",
    "totalTime": "PT55M",
    "recipeYield": 2,
    "nutrition": {
      "calories": "864 calories",
      "fatContent": "51 grams fat",
      "saturatedFatContent": "21 grams saturated fat",
      "carbohydrateContent": "83 grams carbohydrates",
      "sugarContent": "17 grams sugar",
      "fiberContent": "7 grams fiber",
      "proteinContent": "19 grams protein",
      "sodiumContent": "0.94 milligram of sodium"
    },
    "recipeCategory": "Dinner, Main course",
    "recipeIngredients": [
      "1 butternut squash",
      "4 tbsp light olive oil",
      "600ml vegetable stock",
      "50g unsalted butter",
      "1 small onion finely chopped",
      "1 celery stick finely chopped",
      "2 garlic cloves crushed",
      "1 bay leaf",
      "1 tsp fresh thyme leaves picked",
      "140g risotto rice (we like carnaroli)",
      "100ml white wine",
      "50g parmesan (or vegetarian alternative), finely grated"
    ],
    "recipeInstructions": [
      {
        "text": "Heat oven to 200C/180C fan/ gas 6. Peel the squash and separate the bulbous seed-bearing section from the slender end. Chop the slender end into 2cm cubes, toss in half the oil, season lightly and roast in the oven, stirring occasionally, until golden brown on the outside and soft in the centre, about 30 mins. Cut the bulb in half and scrape out the seeds with a spoon – you can keep these to toast in the oven and sprinkle over salads. Chop the flesh into 2cm pieces. Warm the vegetable stock in a small pan, set over a low heat. Drop in squash and leave to gently poach."
      },
      {
        "text": "While the squash is roasting, warm a medium-size frying pan over a gentle heat. Add the remaining olive oil and half the butter, followed by the onion. Cover and cook for 3 mins until the onion turns translucent. Stir in the celery, garlic, herbs and a few turns of pepper (no salt at this stage). Cover again and cook for a further 2 mins. Increase the heat slightly and stir in the rice. Stir, uncovered, for about 5 mins – this will help to develop the toasty aroma of the rice without burning the veg."
      },
      {
        "text": "Turn up the heat, stir in the wine and let it bubble away to almost nothing. Reduce the heat and start adding the stock. Add one ladle at a time, stirring gently but constantly during each addition. The idea is to encourage the rice to absorb the liquid and soften, but also give up its starch to thicken the remaining broth. Don’t stir too aggressively or you will end up with a pan of mush. When the stock has been absorbed, it’s time to add the next ladleful and so on. It will take about 15 mins to reach the final ladle of stock. By this time the squash in the stock should have softened. Mash it up with the remaining stock and stir into the risotto."
      },
      {
        "text": "Turn off the heat, dot the top of the risotto with remaining butter and most of the Parmesan, cover, leave to rest for 2 mins, then stir through and check the seasoning. Spoon the risotto into shallow bowls and sprinkle the roasted squash and leftover Parmesan on top. Serve with crusty bread and Sautéed spinach (below)."
      }
    ],
    "skillLevel": "Easy",
    "forcedURL": "https://www.bbcgoodfood.com/recipes/creamy-risotto-layer-cake"
  }
]